/*
Localizable.strings
Nova

Created by Logan Collins on 12/4/16.
Copyright © 2016 Panic Inc. All rights reserved.
*/


// General
"OK" = "OK";
"Cancel" = "キャンセル";
"None" = "なし";

"Off" = "切";
"On" = "動作中";
"Cut" = "カット";
"Copy" = "コピー";
"Paste" = "ペースト";
"Move" = "移動";
"Duplicate" = "複製";
"Duplicate “%@”" = "“%@”を複製";
"Delete" = "削除";
"Rename" = "リネーム";
"Add" = "ステージ";
"Remove" = "削除";
"Remove “%@”" = "“%@”を削除";
"Insert" = "挿入";
"Open" = "開く";
"Close" = "閉じる";
"Terminate" = "切断";
"Import" = "読み込む";
"Export" = "書き出す";
"Accept" = "信頼";
"Connect" = "接続";
"Disconnect" = "切断";
"Default" = "デフォルト";
"Always" = "常に";
"Never" = "未同期";
"Ignore" = "無視する";

"Clear Menu" = "メニューを削除";
"No Selection" = "選択なし";
"No Value" = "値なし";
"Unknown" = "不明";

"New" = "新規";
"Choose" = "選択";
"Choose…" = "選択…";
"Continue" = "続ける";

"Delete…" = "削除…";
"Delete “%@”…" = "“%@”を削除…";

"Edit…" = "サイト設定を編集…";
"Edit “%@”…" = "“%@”を編集…";

"Next" = "次へ";
"Previous" = "前へ";
"Finish" = "終了";

"Undo" = "取り消す";
"Redo" = "やり直す";

"Loading…" = "ロード中…";

"Create…" = "作成…";

"Custom" = "カスタム";

"Search" = "検索";
"Share" = "共有";

"Back" = "戻る"; // As in nagivation
"Forward" = "進む";  // As in nagivation
"Show All" = "すべてを表示";

"Username" = "ユーザ名";
"Password" = "パスワード";
"Key" = "認証鍵";
"Passphrase" = "パスワード";
"Token" = "トークン";

"Are you sure you want to remove “%@”?" = "本当に “%@” を削除しますか？";
"Are you sure you want to remove %@ items?" = "本当に %@ 項目を削除しますか？";
"This action cannot be undone." = "この操作を取り消すことはできません。";

"%@ (Default)" = "%@（デフォルト）";

"(optional)" = "（オプション）";

"Name:" = "名前: ";
"Where:" = "場所: ";

"System Monospace" = "システム等幅";
"Font Options" = "フォントオプション";
"This font has no optional features available." = "利用可能なフォントオプションはありません。";
"Increase Font Size" = "フォントを大きく";
"Decrease Font Size" = "フォントを小さく";

"Start Logging…" = "ロギングを開始…";
"Stop Logging" = "ロギングを停止…";

"Enabling terminal logging will log all output for this terminal to a file." = "ロギングを有効にすると、このターミナルによる出力の全てがファイルに記録されます。";
"Terminal logs are helpful when troubleshooting terminal issues with Panic's technical support team. To end terminal logging, choose \"Stop Logging\" from the Terminal menu or quit Nova." = "ターミナルのログはPanicのテクニカルサポートチームとターミナルに関するトラブルシューティング時に役立ちます。ロギングを終了するには、ターミナルメニューから \"ロギングを停止\" を選択するか、Novaを終了してください。";

"Start" = "開始";

"Zoom In" = "拡大";
"Zoom Out" = "縮小";
"Zoom to Fit" = "ウインドウに合わせる";
"Actual Size" = "実際のサイズ";

"ON" = "入";
"OFF" = "切";

"Scroll Left" = "左にスクロール";
"Scroll Right" = "右にスクロール";

"Multiple Selection" = "複数選択";
"No Selection" = "選択なし";


// About
// __VERIFIER_IGNORE__ Used by PanicCore with PCAppLocal
"HomepageURL" = "https://www.panic.com/jp/nova/";
// __END_VERIFIER_IGNORE__

"ABOUT_BOX_COPYRIGHT" = "© Panic Inc.";
"Released on %@" = "リリース日: %@";
"Build Number %@" = "ビルド: %@"; // Differentiated from "Build <<TaskName>>", which is a different semantic
"Need Help? Visit our support library." = "ヘルプが必要？サポートライブラリを訪れてください。";
"Acknowledgments" = "謝辞";

"Licensed to:" = "ご登録者: ";
"Unregistered. You have %@ trial days remaining." = "未登録で、試用の残りは %@ 日です。";
"Unregistered. You have 1 trial day remaining." = "未登録で、試用の残りは1日です。";
"Unregistered. Your trial has ended." = "未登録で、試用期間が終了しました。";

"Remove License" = "ライセンスを削除";
"Unlock %@…" = "%@ をアンロックする…";

"You're receiving free updates until %@." = "%@ まで無償アップデートが提供されます。";
"Your year of free updates ended on %@." = "1年間の無償アップデート期間は %@ に終了します。";
"Buy the latest Nova to receive a year of free updates." = "最新のNovaをお求めいただくと、1年間の無償アップデートが提供されます。";

"Manage License…" = "ライセンスを管理…";
"Purchase Nova…" = "Novaを購入…";


// License & Trial
"Try Nova for 30 Days" = "Novaを30日間試用する";
"We want to make sure Nova works for you, and we think you'll never go back.\n\nAfter 30 days, Nova will stop working, but you'll be able to export your data.\n\nWhen you buy Nova, you keep it forever — and get one free year of updates." = "30日後にNovaはご利用いただけなくなりますが、制作されたデータは書き出すことが可能です。\n\nNovaを購入いただくとアンロックされ、1年間のサポートと機能アップデートが無償で提供されます。";

"You have just %@ days left to test Nova." = "Novaの試用期間の残りは %@ 日です。";
"You have just 1 more day to test Nova." = "Novaの試用期間の残りは1日です。";
"We hope you’ve been enjoying your trial, and we hope you love Nova. Buy Nova today to ensure your work isn’t rudely interrupted.\n\nWhen you buy Nova, you keep it forever, and get one free year of feature updates and support." = "Novaとの制作の日々はいかがでしたか？お気に召したでしょうか。Novaを今すぐ購入し、この環境をぜひ継続ください。\n\nNovaを購入するとアンロックされ、1年間のサポートと機能アップデートが無償で提供されます。";

"Thank you for trying Nova." = "Novaをお試しいただき、ありがとうございました。";
"Your 30 day trial has ended. To continue using Nova, buy it today. When you buy Nova, you keep it forever, and get one free year of feature updates and support." = "30日間の試用期間が終了しました。継続してご利用になるにはお求めください。Novaを購入するとアンロックされ、1年間のサポートと機能アップデートが無償で提供されます。";

"Have A Different License?" = "他のライセンスをお持ちですか？";
"Already Purchased?" = "購入済みですか？";

"Thank you very much for purchasing Nova!" = "Novaをお求めいただきありがとうございます！";
"All limitations of the unregistered demo version have been removed. Thank you for your purchase! We hope you enjoy Nova." = "未登録状態での制限が解除され、すべての機能がご利用いただけるようになりました。お求めいただきありがとうございます！Novaをどうぞ存分にご活用ください。";

"To use the latest version of Nova, you must purchase another year of updates." = "最新のNovaをご利用いただくには、1年単位のアップデート利用権をお求めいただく必要があります。";
"Your purchase of Nova included one full year of free updates, which expired on %@. If you'd like to use the latest Nova updates, buy another year now. You can also re-download the last version available to you." = "お求めいただいたNovaに含まれていたアップデート利用権は %@ に有効期限が切れました。最新のNovaにアップデートするには改めて利用権をお求めください。それにより最新版を再びダウンロードいただけるようになります。";

"Buy Nova now." = "Novaを今すぐ購入。";
"1 day left. Buy Nova now." = "残り1日。今すぐNovaを購入。";
"%@ days left. Buy Nova now." = "残り %@ 日。今すぐ購入。";

"This beta version of Nova has expired." = "このベータ版の使用期間は終了しました。";
"Thanks for your help!" = "ご協力、ありがとうございました！";

"Quit" = "終了";

"Could not write to the Nova preferences." = "Nova環境設定に書き込めませんでした。";
"Make sure the Nova preferences file is unlocked and you have write permissions to it." = "Nova環境設定ファイルに十分なアクセス権があることをご確認ください。";

"LicenseSerialInvalidMessage" = "%@ のシリアル番号では無いようです。"; // %@ is the app name
"LicenseSerialInvalidDescription" = "数字およびダッシュ（-）がすべて正しく入力されているかどうかを確認してください。レシートメールからコピー＆ペーストで入力するのも良い方法です。 (%d)"; // %d is an error code

"LicenseNotAuthorizedMessage" = "入力されたライセンス番号は期限切れのため、このバージョンの %@ をロック解除できません。"; // %@ is the app name
"LicenseNotAuthorizedDescription" = "あなたのライセンスでサポートされる最新バージョンは %@ よりご確認ください。"; // %@ is a URL domain

"SerialCheckNetErrorMsg" = "%@ はあなたのシリアル番号をオンライン検証できませんでした。"; // %@ is the app name
"SerialCheckNetErrorTxt" = "%@ がサーバと認証するのを妨げている可能性のあるフィルタリングアプリ等を一時的にオフにしてみてください。またテザリング等の別の回線の利用もご検討ください。"; // %@ is the app name

"Try Again" = "リトライ";

// macOS Pre-release Version Alert
"You seem to be running a pre-release version of macOS." = "プレリリース版macOSが実行されている様です。";
"While %@ may work without issues, please keep in mind that pre-release OS versions are not fully supported and you may encounter crashes or erratic behavior. We do not recommend using them for production work." = "%@ は一見すると問題なく動作しているように見えるかも知れません。しかしながらプレリリース版OSはサポートが確認されていないため、意図しないクラッシュや不安定な動作が引き起こされる可能性についてご注意ください。実稼働環境での使用はお勧めしません。";


// Colors
"Red" = "レッド";
"Orange" = "オレンジ";
"Yellow" = "イエロー";
"Green" = "グリーン";
"Viridian" = "ビリジアン";
"Teal" = "ティール";
"Sky" = "スカイ";
"Ocean" = "オーシャン";
"Azure" = "アズール";
"Amethyst" = "アメジスト";
"Pink" = "ピンク";
"Magenta" = "マゼンダ";
"Gray Blue" = "ブルーグレー";
"Gray Green" = "グリーングレー";
"Gray Brown" = "ブラウングレー";


// Workspaces
"Workspace" = "ワークスペース";

"New Window" = "新規ウインドウ";

"Close Window" = "ウインドウを閉じる";
"Close Window Tab" = "ウインドウタブを閉じる";
"Close Other Window Tabs" = "他のウインドウタブをすべて閉じる";

"Show Window Tab Bar" = "ウインドウタブバーを表示";
"Hide Window Tab Bar" = "ウインドウタブバーを隠す";

"Show All Window Tabs" = "すべてのウインドウタブを表示";
"Hide All Window Tabs" = "すべてのウインドウタブを隠す";

"Create a new tab" = "新規タブを作成";
"New Tab" = "新規タブ";

"Create a new split" = "新規分割ウインドウを作成";
"New Split" = "新規分割";

"Show pane options" = "ペインオプションを表示";
"Pane Options" = "ペインオプション";

"Lock Split" = "分割をロック";
"Unlock Split" = "分割のロックを解除";

"Magnify Split" = "分割を拡大";
"Demagnify Split" = "分割を縮小";

"Magnify this split" = "この分割を拡大";
"Demagnify this split" = "この分割を縮小";

"Close this split" = "この分割を閉じる";

"Recently Closed Tabs" = "最近閉じたタブ";

"Duplicate Tab in Split Above" = "上に分割";
"Duplicate Tab in Split Below" = "下に分割";
"Duplicate Tab in Split On Left" = "左に分割";
"Duplicate Tab in Split On Right" = "右に分割";

"Close Tab" = "タブを閉じる";
"Close Other Tabs" = "その他のタブを閉じる";
"Close Tabs to the Right" = "右のタブを閉じる";
"Move All %@ Tabs To This Pane" = "すべての %@ タブをこのペインに移動";
"Move All Tabs With Ancestor" = "親タブと共にすべてのタブを移動";
"Close All Tabs" = "すべてのタブを閉じる";

"Pin Tab" = "タブをピン留め";
"Unpin Tab" = "ピン留めを外す";

"Unpin this tab" = "このタブのピン留めを外す";

"Mute this tab" = "このタブをミュート";
"Unmute this tab" = "このタブのミュートを解除";

"Sort Tabs by Name" = "タブを名前で並び替える";
"Sort Tabs by Type" = "タブを形式で並び替える";

"Build" = "ビルド";
"Run" = "実行";
"Clean" = "クリーン";
"Stop" = "終了";

"Status" = "状況";

"Choose where to create the project directory." = "プロジェクトディレクトリの作成先を選択してください。";
"Choose where to create the repository clone." = "リポジトリクローンの作成先を選択してください。";
"Choose the project directory to add." = "追加するプロジェクトディレクトリを選択してください。";

"Show view options for the window" = "このウインドウの表示オプションを表示";
"Show project settings for the window" = "このウインドウのプロジェクト設定を表示";

"Are you sure you want to close “%@”?" = "本当に “%@” を閉じますか？";
"Closing this window will stop the task “%@”." = "このウインドウを閉じると、タスク “%@” も終了します。";
"Closing this window will stop %@ tasks." = "このウインドウを閉じると、“%@” タスクも終了します。";

"Content Not Available" = "コンテンツが利用できません";
"The content for this tab could not be loaded.\nThis tab may be safely closed." = "このタブのコンテンツを読み込めませんでした。\nタブは安全に閉じられているようです。";

"The name “%@” is not valid." = "“%@”は無効な名前です。";
"The name “%@” is already in use." = "名前“%@”は既に使われています。";
"Please choose a different name." = "ほかの名前をご利用ください。";

"Cannot read metadata object from file: “%@”." = "ファイル: “%@ のメタデータオブジェクトを読めません。";
"The file does not contain a valid JSON object at its root." = "ファイルのルートに有効なJSONオブジェクトが含まれていません。";


// Tabs
"Show All Tabs" = "すべてのタブを表示";
"Exit Tab Overview" = "タブの概要表示を終了";

"Split Above" = "上に分割";
"Split Below" = "下に分割";
"Split on Left" = "左に分割";
"Split on Right" = "右に分割";


// Sidebars
"Sidebars" = "サイドバー";
"Show Sidebar" = "サイドバーを表示";
"Show Sidebars" = "サイドバーを表示";
"Show Left Sidebar" = "左サイドバーを表示";
"Show Right Sidebar" = "右サイドバーを表示";
"Hide Sidebar" = "サイドバーを隠す";
"Hide Sidebars" = "サイドバーを隠す";
"Hide Left Sidebar" = "左サイドバーを隠す";
"Hide Right Sidebar" = "右サイドバーを隠す";

"Show the left sidebar" = "左サイドバーを表示";
"Hide the left sidebar" = "左サイドバーを隠す";
"Show the right sidebar" = "右サイドバーを表示";
"Hide the right sidebar" = "右サイドバーを隠す";
"Show the debug pane" = "デバッグペインを表示";
"Hide the debug pane" = "デバッグペインを隠す";

"Sidebar Layout" = "サイドバーレイアウト";

"New Layout…" = "レイアウトを保存…";
"Manage Layouts…" = "レイアウトを管理…";
"No Layouts" = "レイアウトなし";

"Another layout with the name “%@” already exists." = "すでに同じ名前のレイアウト \"%@\" が存在しています。";
"Do you want to replace it?" = "置き換えますか？";

"Left Sidebar" = "左に表示";
"Right Sidebar" = "右に表示";

"All Sidebars" = "すべてのサイドバー";

"Drag a sidebar icon here to dock." = "Dockに追加するには、サイドバーアイコンをドラッグします。";

"This sidebar requires an extension that is not installed. You can try installing it from the extension library." = "このサイドバーに必要な機能拡張がインストールされていません。機能拡張ライブラリからインストールしてみてください。";

"Show Debug Pane" = "デバッグペインを表示";
"Hide Debug Pane" = "デバッグペインを隠す";

"Hide the Debug Pane" = "デバッグペインを隠す";



// Files
"Files Sidebar" = "ファイルサイドバー";
"File Browser" = "ファイルブラウザ";

"New File Browser" = "新規ファイルブラウザ";

"Local" = "ローカル";
"Remote" = "リモート";

"This folder is empty." = "このフォルダは空です。";

"Filtering…" = "フィルタリング…";
"No results found." = "何も見つかりませんでした。";

"No remote destinations have been added to this project." = "このプロジェクトには公開先が設定されていません。";
"Open a project or server to manage remote files." = "プロジェクトまたはサーバ設定を開いて、リモートファイルを管理します。";

"Add Destination…" = "公開先を追加…";
"Edit Destination…" = "公開先を編集…";

"Files: New File" = "ファイル: 新規ファイル";
"Enter the path for the new file." = "新規ファイルのパスを入力します。";

"Files: New Folder" = "ファイル: 新規フォルダ";
"Enter the path for the new folder." = "新規フォルダのパスを入力します。";

"Files: Duplicate File" = "ファイル: 複製";
"Enter the new path for the duplicate." = "複製先のパスを入力します。";

"Files: Move File" = "ファイル: 移動";
"Files: Rename File" = "ファイル: リネーム";
"Enter the new path for the file." = "ファイルの新しいパスを入力します。";
"Enter the new path for the folder." = "フォルダの新しいパスを入力します。";

"Show in Files Sidebar" = "ファイルサイドバーで表示";
"Show in Finder" = "Finderに表示";

"Copy Path" = "パスをコピー";
"Copy Relative Path" = "相対パスをコピー";

"Show Hidden Files" = "不可視項目を表示";
"Hide Hidden Files" = "不可視項目を隠す";

"Show Ignored Files" = "除外ファイルを表示";
"Hide Ignored Files" = "除外ファイルを隠す";

"Are you sure you want to delete “%@”?" = "本当に \"%@\" を削除しますか？";
"Are you sure you want to delete the selected %@ items?" = "本当に選択された %@ 項目を削除しますか？";

"The selected items will be deleted immediately." = "選択された項目は直ちに削除されます。";
"The selected items will be moved to the Trash." = "選択された項目は直ちにゴミ箱に入れられます。";

"No Selected Items" = "選択項目なし";
"No Available Applications" = "利用可能なアプリなし";

"You are about to open %@ files, do you want to continue?" = "1度に %@ のファイルを開こうとしていますが、続けますか？";
"Opening many files at once may temporarily degrade performance." = "1度に多くのファイルを開くと、パフォーマンスが低下することがあります。";

"Go to Project Local Path" = "プロジェクトローカルパスに移動";
"Go to Local “%@”" = "ローカル \"%@\" へ移動";

"Go to Server Remote Path" = "サーバリモートパスに移動";
"Go to Remote “%@”" = "リモート \"%@\" へ移動";

"Transcript" = "トランスクリプト";
"No Transcripts" = "トランスクリプトなし";


// Projects
"Project Settings" = "プロジェクト設定";

"Project" = "プロジェクト";
"Build & Run" = "ビルド&実行";
"Remote Files" = "リモート";
"Extensions" = "機能拡張";
"Languages & Extensions" = "言語＆機能拡張";

"Global Default" = "グローバルデフォルト";
"Global Default (%@)" = "グローバルデフォルト (%@)";

"Stretch" = "拡大して配置";
"Center" = "中央に配置";
"Tile" = "並べて配置";

"Extension Preferences…" = "機能拡張環境設定…";
"Extension Settings…" = "機能拡張設定…";


// Authentication
"Authentication Required for “%@”." = "“%@” に認証が必要です。";
"Password Required for “%@”." = "“%@” にパスワードが必要です。";
"Key Passphrase Required for “%@”." = "“%@” にパスフレーズが必要です。";
"PIN Required for “%@”." = "“%@” にパスコードが必要です。";
"Two Factor Required for “%@”." = "“%@” に2ファクタ認証が必要です。";
"SSH Interactive Request" = "SSHインタラクティブ要求";
"Username:" = "ユーザ名:";
"Password:" = "パスワード:";
"Passphrase:" = "パスフレーズ:";
"Token:" = "トークン:";
"PIN:" = "パスコード:";
"Key:" = "認証鍵:";
"Code:" = "コード:";

"Select a private key file to use." = "使用する秘密鍵ファイルを選択します。";


// Connections
"Connecting to “%@”…" = "“%@” に接続中…";
"Could not connect to server." = "サーバに接続できませんでした。";
"Could not connect to server “%@”." = "サーバ “%@” に接続できませんでした。";

"Not connected." = "接続されていません。";
"Connection cancelled." = "接続はキャンセルされました。";
"Retry" = "リトライ";

"The server “%@” does not have an address specified." = "サーバ “%@” の有効なアドレスがありません。";
"Please specify an address with which to connect." = "接続先のアドレスを正しく指定してください。";

"%@ can’t verify the identity of the server “%@”." = "%@ はサーバ “%@” を認証できません。";

"Host key changed for “%@”." = "ホスト鍵は “%@” に変更されました。";
"SSH Host Key Changed Message" = "前回の接続からホスト鍵が変更されました。変更を承認し接続を継続するか、変更が確実かをサーバ管理者にお尋ねください。";
"Do you want to accept the host key for “%@”?" = "“%@” の鍵を承認しますか？";
"It appears this is the first time you have connected to this host, would you like to continue?" = "このホストへの接続は初めての様です。鍵を承認し接続を続けますか？";
"HostKeyChangedURL" = "https://library.panic.com/ja/general/host-key-changed/";

"The server you are attempting to connect to uses a protocol that is unsupported in this version of %@. Check our website for compatibility information for this protocol." = "このバージョンの %@ では、サーバに接続しようとしているこのプロトコルをサポートしていません。互換性についてサポートページをご確認ください。";

"Save in Keychain" = "キーチェーンに保存";

"A PIN code is required to unlock your secure token." = "セキュアトークンのアンロックにはパスコードが必要です。";
"Please enter the pin for “%@”." = "“%@” のパスコードを入力してください。";
"PIN" = "パスコード";


// Task Configurations
"Run" = "実行";
"Tasks" = "タスク";
"Edit Task…" = "タスクを編集…";

"Building %@" = "%@ をビルド中";
"Running %@" = "%@ を実行中";
"Cleaning %@" = "%@ をクリーン中";

"Add a new task" = "新規タスクを追加";

"Set the active task" = "アクティブタスクを設定";
"No Tasks" = "タスクなし";

"Build the current task" = "現在のタスクをビルド";
"Run the current task" = "現在のタスクを実行";
"Stop the running task" = "実行中のタスクを終了";

"Running Task" = "タスクを実行中";
"Running %@" = "%@ を実行中";

"Task “%@” encountered an uncaught signal." = "タスク “%@” でキャッチされないシグナルは発生しました。";
"Task “%@” exited with a non-zero exit status: %d." = "タスク “%@” はゼロ以外の終了ステータスで終了しました: %d。";

"Could not execute the task script." = "タスクスクリプトを実行できませんでした。";
"Check to make sure the script has a valid shebang declaration (such as “#!/bin/sh”) for the desired scripting language." = "目的のスクリプト言語に対応する適切なシバン宣言（例: “#!/bin/sh”）が記述されているかをご確認ください。";

"The script does not appear to be executable. Do you want to make it executable?" = "スクリプトは実行可能では無いようです。実行可能にしますか？";
"Show Configuration…" = "構成を表示…";
"Make Executable" = "実行可能にする";

"Do you want to remove the task “%@”?" = "タスク “%@” を削除しますか？";

"Stop “%@”?" = "“%@” を終了しますか？";
"The task “%@” is already running. Choose “Stop” to terminate and restart it, or “Add” to launch an additional instance." = "すでにタスク “%@” は実行中です。“終了”を選択して中断し再開するか、“追加”から追加インスタンスを起動してください。";
"The task “%@” is already running. Choose “Stop” to terminate and restart it." = "すでにタスク “%@” は実行中です。“終了”を選択して中断し再開してください。";

"Could not run “%@”." = "“%@” を実行できませんでした。";
"The task may be misconfigured or malformed. Check to make sure its settings are correct and not currently in conflict within source control." = "タスクの構成か形式が正しくない可能性があります。 設定が正しいか、またソース管理内で競合していないかをご確認ください。";

"Task configuration “%@” not found." = "タスク構成 “%@” が見つかりません。";
"No task configuration was found in the project with the name “%@”." = "プロジェクト内に名前 “%@” のタスク構成は見つかりませんでした。";

"The task contains one or more links between other tasks that create an infinite loop." = "タスクに無限ループを作成する他のタスクへのリンクが1つ以上含まれています。";

"The extension assistant with identifier “%@” failed to resolve the action." = "識別子 “%@” の拡張アシスタントはアクションを解決できませんでした。";

"Task template not found for “%@”." = "“%@” のタスクテンプレートが見つかりませんでした。";
"The template for this task was not found in the extension “%@”. Make sure the extension is up to date, or consider contacting the extension author." = "機能拡張 “%@” 内にタスクのテンプレートが見つかりませんでした。機能拡張が最新か、また作者へのお問い合わせをご検討ください。";

"(Deprecated)" = "（非推奨）";
"This task type is deprecated." = "このタスクタイプは推奨されません。";

"This task requires an extension that is not installed. You can try installing it from the extension library." = "このタスクにはインストールされていない機能拡張が必要です。ライブラリからインストールしてみてください。";

"This extension is required in order to run the task “%@”." = "タスク “%@” の実行にはこの機能拡張が必要です。";

"Build %@" = "%@ をビルド";
"Run %@" = "%@ を実行";
"Clean %@" = "%@ をクリーン";

"Finished Running Task" = "実行中のタスクを完了";
"Finished Running %@" = "実行中の %@ を完了";

"Build Started" = "ビルド開始";
"Build Generated Issues" = "ビルドが問題を生成";
"Build Failed" = "ビルド失敗";
"Build Succeeded" = "ビルド成功";

"Clean Started" = "クリーン開始";
"Clean Failed" = "クリーン失敗";
"Clean Succeeded" = "クリーン成功";

"Task Started" = "タスク開始";
"Task Paused" = "タスク停止";
"Task Generated Issues" = "タスク: 問題を生成";
"Task Generated Output" = "タスク: 出力を生成";
"Task Exited Unexpectedly" = "タスク: 予期せず終了";
"Task Failed" = "タスク失敗";
"Task Completed" = "タスク完了";

"Custom Task" = "スクリプトを実行";

"On This Mac" = "このMac上";
"No SSH Servers" = "SSHサーバなし";

"Default Remote Interpreter" = "デフォルトリモートインスペクタ";

"TASK_VARIABLE_WorkspaceName" = "プロジェクト名";
"TASK_VARIABLE_WorkspaceFolder" = "プロジェクトパス";
"TASK_VARIABLE_WorkspaceFolderBasename" = "プロジェクトフォルダ名";
"TASK_VARIABLE_BranchName" = "ブランチ名";

"TASK_VARIABLE_File" = "ファイルパス";
"TASK_VARIABLE_FileRelative" = "ファイル相対パス";
"TASK_VARIABLE_FileBasename" = "ファイル名";
"TASK_VARIABLE_FileDirname" = "ファイルの親フォルダ名";
"TASK_VARIABLE_FileExtname" = "ファイル拡張子";
"TASK_VARIABLE_LineNumber" = "行番号";
"TASK_VARIABLE_SelectedText" = "選択されたテキスト";

"Currently Focused File" = "現在選択されているファイル";

"Extension Command" = "機能拡張コマンド";
"Command:" = "コマンド:";

"Configuration Value" = "設定値";
"Key:" = "認証鍵:";

"%@ Pipeline" = "%@ パイプライン";
"The primary step contributed by this task." = "このタスクによって提供される主要なステップです。";
"This task does not contribute a primary step to this pipeline." = "このタスクはこのパイプラインに主要なステップを提供しません。";

"Unknown Action" = "不明なアクション";
"This action is of an unknown type and may have been added by a newer version of %@." = "このアクションは不明な形式で、おそらく新しいバージョンの %@ で追加されました。";

"Step %@ of %@" = "ステップ %@ / %@";

"Run Script" = "スクリプトを実行";
"Run Task" = "タスクを実行";
"Run Another Task" = "他のタスクを実行";
"Play Sound" = "サウンドを再生";
"Speak Text" = "テキストを読み上げる";


// Publishing
"Publish" = "公開";
"Publishing" = "公開";

"Publish files to a remote server" = "ファイルをリモートサーバへ公開";

"Do you want to remove the remote destination “%@”?" = "本当に公開先 “%@” を削除しますか？";

"No Servers" = "サーバなし";
"No server was found in your preferences with the name “%@”." = "名前 “%@” というサーバを設定から見つかりませんでした。";
"Multiple servers were found in your preferences with the name “%@”." = "名前 “%@” というサーバが設定から複数見つかりました。";

"Add a new remote destination" = "新規公開先を追加";

"No Destinations" = "公開先なし";
"Add a new destination to your Project Settings to enable publishing." = "公開機能を利用するにはあらかじめ、公開先を設定しておく必要があります。";

"No changes to publish." = "公開する変更はありません。";
"No remote destinations have been added to this project." = "このプロジェクトには公開先が設定されていません。";
"Publishing can only be enabled for a project with a local folder." = "公開機能を利用するにはあらかじめ、ローカルフォルダを設定しておく必要があります。";

"Publish All" = "すべてを公開";
"Publish Checked" = "マーク項目を公開";

"Clear" = "削除";
"Clear All" = "すべてを削除";
"Clear Checked" = "マーク項目を削除";

"Are you sure you want to clear “%@” marked for publishing?" = "本当に公開マークされた “%@” からマークを外しますか？";
"Are you sure you want to clear %@ files marked for publishing?" = "本当に公開マークされた %@ ファイルからマークを外しますか？";

"Publish Selected Items…" = "選択項目を公開…";
"Publish “%@”…" = "“%@” を公開…";

"Publish All Changes to “%@”…" = "すべての変更を “%@” へ公開…";
"Publish All Checked Changes to “%@”…" = "チェックしたすべての変更を “%@” へ公開…";

"Publish Selected Items" = "選択された項目を公開";
"Publish Selected Items to “%@”" = "選択された項目を “%@” へ公開";
"Publish “%@” to “%@”" = "“%@” を “%@” へ公開";

"Reverse Publish Selected Items" = "選択された項目をダウンロード";
"Reverse Publish “%@” to “%@”" = " “%@” から “%@” へダウンロード";

"Are you sure you want to publish “%@” to “%@”?" = "本当に “%@” を “%@” へ公開しますか？";
"Are you sure you want to publish %@ files to “%@”?" = "本当に %@ ファイルを “%@” へ公開しますか？";
"Publishing will upload the selected files to the same relative location on the server, and will overwrite any existing files." = "選択されたファイルはサーバ上の相対的な領域にアップロードされ、既存のファイルは上書きされます。";

"Clear Selected Items…" = "選択項目を削除…";
"Clear “%@”…" = "“%@” を削除…";

"Add Ignore Rules for Selected Items" = "選択項目の無視ルールを追加";
"Add Ignore Rule for “%@”" = "“%@” の無視ルールを追加";

"Publishing to “%@”…" = "“%@” へ公開…";

"Publish Started" = "公開開始";
"Publish Finished" = "公開終了";
"Publish Failed" = "公開失敗";


// Documents
"Document" = "書類";

"New Document" = "新規書類";
"Current Document" = "現在の書類";

"untitled" = "名称未設定";
"Untitled" = "名称未設定";

"Opening “%@”…" = "“%@” を開いています…";
"Closing “%@”…" = "“%@” を閉じています…";
"Reverting “%@”…" = "“%@” を戻しています…";
"Saving “%@”…" = "“%@” を保存しています…";
"Downloading “%@”…" = "“%@” をダウンロードしています…";
"Uploading “%@”…" = "“%@” をアップロードしています…";

"The document “%@” is closed." = "書類 “%@” は閉じています。";

"Save before closing?" = "閉じる前に保存しますか？";
"Do you want to save the changes you made in the document “%@”?" = "書類 “%@” に加えた変更を保存しますか？";
"Save" = "保存";
"Don't Save" = "保存しない";
"Save…" = "保存…";

"The document “%@” has been changed by another application since you opened or saved it." = "書類 “%@” は開かれてから、または保存されてから他のアプリによって変更されています。";
"The changes made by the other application will be lost if you save. Save anyway?" = "保存すると、ほかのアプリケーションで加えられた変更は失われます。それでも保存しますか?";
"Save Local Copy…" = "ローカルコピーとして保存…";

"Could not save changes to “%@”: %@" = "“%@” への変更は保存できませんでした: %@";
"Do you want to discard the changes you made in the document “%@” and close it anyway?" = "書類 “%@” に加えた変更を破棄し、閉じますか？";
"Discard Changes" = "変更を破棄";

"The document “%@” is currently being saved." = "書類 “%@” は保存中です。";
"Do you want to wait to close the document once changes are saved?" = "変更が保存されるまで待機してから閉じますか？";
"Close After Saving" = "保存後に閉じる";
"Don't Close" = "閉じない";

"Review Unsaved Changes?" = "未保存の変更を確認しますか？";
"There are multiple documents with unsaved changes. Do you want to review them, or discard all changes?" = "変更が保存されていない複数の書類があります。それらを確認しますか？それともすべての変更を破棄しますか？";

"Review All" = "すべてを確認";
"Discard All" = "すべてを破棄";

"Revert" = "戻す";
"Do you want to revert the document “%@” to the latest saved version?" = "書類 “%@” を最後に保存されたバージョンに戻しますか？";
"Unsaved changes will be discarded." = "未保存の変更はすべて破棄されます。";

"Refactor" = "リファクタリング";

"Rename…" = "名前を変更…";
"Rename" = "リネーム";

"Reformat…" = "再フォーマット…";
"Reformat" = "再フォーマット";

"Waiting on extensions to finish pre-save actions…" = "機能拡張による保存前操作の完了を待っています…";
"Waiting on %@ to finish pre-save actions…" = "%@ による保存前操作の完了を待っています…";

"Could not open “%@”." = "“%@” を開けませんでした。";
"Could not revert “%@”." = "“%@” を戻せませんでした。";
"Could not save “%@”." = "“%@” を保存できませんでした。";
"Could not download “%@”." = "“%@” をダウンロードできませんでした。";
"Could not upload “%@”." = "“%@” をアップロードできませんでした。";

"The file is in a format or encoding that could not be interpreted." = "ファイルは、解釈できない形式またはエンコードです。";
"The document may not exist on disk or you may not have permissions to read it." = "書類がディスク上に存在しないか、読み取り権限が無いかもしれません。";
"Could not find a registered document class capable of opening the file." = "ファイルを開くことができる登録済みドキュメントクラスが見つかりませんでした。";

"The document is not in a state where the operation can be performed safely. Try waiting until other operations are complete or reopen the document." = "書類が、その操作を安全に実行できる状態にありません。他の操作が完了するまで待つか、書類を開き直してください。";
"The document could not be written with the chosen text encoding." = "選択されたテキストエンコードで書類を開けませんでした。";

"You do not have permission to save the file “%@”. To continue, %@ needs administrator access to invoke a privileged helper tool." = "ファイル “%@” を保存する権限がありません。継続するには %@ にヘルパーツールを呼び出すための管理者アクセス権が必要です。";

"The text being replaced does not match" = "置換文字列が一致しません";
"The document may have been modified since the edit was performed. Try performing the operation again." = "編集後に書類が変更された可能性があります。再度お試しください。";


// Indexing
"Indexing Files…" = "ファイルをインデックス化中…";
"Initializing Index…" = "インデックスの初期化中…";


// Find & Replace
"Find" = "検索";
"Replace" = "置換";
"Replace All" = "すべてを置換";

"1 match" = "マッチ: 1";
"%@ matches" = "マッチ: %@";
"%1$@ ⁄ %2$@ matches" = "マッチ: %1$@ ⁄ %2$@";

"Recent Patterns" = "パターン履歴";
"No Recent Patterns" = "パターン履歴なし";
"Clear Recent Patterns" = "パターン履歴を削除";

"Queueing…" = "キュー中…";
"Queueing %@ files…" = "キュー中: %@";
"%1$@ ⁄ %2$@ files" = "%1$@ ⁄ %2$@ ファイル";
"%@ files remaining…" = "残り: %@";

"Cancel current operation" = "現在の操作をキャンセル";
"Clear results" = "結果を消去";

"%@ results in %@ files." = "結果 %@: %@ ファイル内";
"No Results for “%1$@” in %2$@" = "結果なし: “%1$@” / %2$@";

"Regex Invalid" = "無効な正規表現";

"contains" = "次を含む";
"matches word" = "単語にマッチ";
"starts with" = "以下で始まる";
"ending with" = "以下で終わる";
"matches regex" = "正規表現にマッチ";
"match case" = "大文字小文字を区別";
"ignore case" = "大文字小文字を区別しない";

"Any Characters" = "あらゆる文字";
"Any" = "あらゆる";
"Word Characters" = "すべての単語";
"Word" = "単語";
"Digits" = "すべての数字";
"Whitespace" = "すべての空白";
"Non-ASCII Characters" = "非ASCII文字";
"Hexadecimal Digits" = "16進数";

"Tab" = "タブ";
"Word Break" = "折り返し";
"Line Break" = "改行";

"Wildcards" = "ワイルドカード";
"Current Wildcards" = "現在のワイルドカード";

"In %@" = "%@ 内"; // As in "In Project", "In 2 Folders", etc.
"%@ Folders" = "%@ フォルダ";
"Containing Folders" = "含まれるフォルダ";
"Choose Folders…" = "フォルダを選択…";

"Filters" = "フィルタ";

"1 filter" = "1フィルタ";
"%@ filters" = "%@ フィルタ";

"Matching all of:" = "以下とすべてマッチ:";
"Matching one or more of:" = "以下と1つ以上がマッチ";
"No custom filters created." = "カスタムフィルタは作成されていません。";

"New Filter" = "新規フィルタ";

"This filter will be grouped as “%@”." = "このフィルタは以下のようにグループ化されます: “%@”。";
"matching all" = "すべてマッチ";
"matching one or more" = "1つ以上がマッチ";

"Searching open files for this remote project." = "このリモートプロジェクトの開かれたファイルを検索しています。";
"Searching open files; open a folder to search project-wide." = "開かれたファイルの検索: フォルダを開きプロジェクト全体を検索します。";

"Are you sure you want to replace all?" = "本当にすべてを置き換えますか？";
"This will replace %@ results in %@ files." = "これにより %@（%@ ファイル内）が置き換えられます。";

"Replace All in Document" = "文書内のすべてを置換";

"Could not open file." = "ファイルを開けませんでした。";
"The document may have been moved or deleted since the search was performed. Try performing the search again." = "検索の実行後に書類が移動または削除されたかも知れません。検索を再度実行してみてください。";

"Text no longer matches find results." = "テキストが検索結果とマッチしなくなりました。";
"The document may have been modified since the search was performed. Try performing the search again." = "検索の実行後に書類が変更されたかも知れません。検索を再度実行してみてください。";


// Clips
"Clips" = "クリップ";

"(untitled group)" = "（名称未設定グループ）";
"(untitled clip)" = "（名称未設定クリップ）";

"Anywhere" = "すべての場所";

"Insert Placeholder" = "プレイスホルダーを挿入";
"Edit Placeholder" = "プレイスホルダーを編集";

"Named Placeholder" = "名前付プレイスホルダー";

"Date" = "日付";
"Filename" = "ファイル名";
"Parent Folder" = "親フォルダ";
"Project Name" = "プロジェクト名";
"Author Name" = "所有者名";
"Source Control Revision" = "ソース管理リビジョン";

"Insertion Point" = "挿入ポイント";
"Text Selection" = "選択テキスト";
"Previous Text" = "前のテキスト";
"Pasteboard Text" = "クリップボードの内容";

"Click the + button to add clips." = "クリップを追加するには + ボタンをクリックします。";
"More clips can be found in the Extension Library." = "機能拡張ライブラリではより多くのクリップを見つけることができます。";
"No matching clips found." = "マッチするクリップが見つかりませんでした。";


// Issues
"Issues" = "問題";
"Fix" = "修正";
"Apply Fixit" = "修正を適用";

"Error" = "エラー";
"Warning" = "警告";
"Hint" = "ヒント";
"Info" = "情報";

"1 issue" = "問題: 1";
"%@ issues" = "問題: %@";

"None of your installed extensions are providing live validation for this project." = "インストールされたいずれの機能拡張も、このプロジェクト用のバリデーションを提供していません。";
"Some extensions may require that files be open to perform validation." = "一部の機能拡張ではバリデーションを実行するためにファイルを開く必要があります。";


// Debug
"Debug" = "デバッグ";
"Debugger" = "デバッガ";
"Debug Console" = "デバッグコンソール";

"Show Debug Gauges" = "デバッグゲージを表示";
"Hide Debug Gauges" = "デバッグゲージを隠す";

"CPU" = "CPU";
"Memory" = "メモリ";
"Disk" = "ディスク";

"Attaching to %@…" = "%@ へのアタッチを待機中…";
"Waiting for connections…" = "接続の待機中…";
"Finished running %@" = "%@ の実行を終了";

"Activate Breakpoints" = "ブレークポイントを追加";
"Deactivate Breakpoints" = "ブレークポイントを削除";

"Pause" = "中断";
"Continue" = "続ける";

"Pause execution" = "プログラム実行を停止";
"Continue execution" = "プログラム実行を再開";

"Thread %d" = "スレッド %d";
"Line %d" = "行 %d";

"Unnamed Breakpoint" = "名称未設定ブレークポイント";

"Enable Function Breakpoint" = "関数ブレークポイントを有効化";
"Function" = "関数";
"Functions" = "関数";
"Example: “myFunctionName”" = "例: “myFunctionName”";

"One or more active sessions do not support function breakpoints: %@" = "1つ以上のアクティブなセッションが、以下の関数ブレークポイントをサポートしていません: %@";
"One or more active sessions do not support breakpoint conditions: %@" = "1つ以上のアクティブなセッションが、以下のブレークポイント条件をサポートしていません: %@";
"One or more active sessions do not support exception options: %@" = "1つ以上のアクティブなセッションが、以下の例外オプションをサポートしていません: %@";

"Exceptions" = "例外";
"Enable Exception Breakpoint" = "例外ブレークポイントを有効化";
"Enable Exception Breakpoint for “%@”" = "“%@” の例外ブレークポイントを有効化";

"%@ has encountered an exception:" = "%@で例外が発生しました:";

"Enable Breakpoint in %@:%ld" = "以下のブレークポイントを有効化: %@:%ld";

"No debug session is running." = "デバッグセッションは実行されていません。";
"No variables to display." = "表示する編集はありません。";
"Fetching variables…" = "変数の取得…";
"Debug session is running." = "デバッグセッションが実行中です。";

"Auto" = "自動";

"Printing description of “%@”:" = "“%@”の説明を印刷中:";

"Add Breakpoint at Current Line" = "現在の行にブレークポイントを追加";
"Remove Breakpoint at Current Line" = "現在の行のブレークポイントを削除";
"Enable Breakpoint at Current Line" = "現在の行のブレークポイントを有効化";
"Disable Breakpoint at Current Line" = "現在の行のブレークポイントを無効化";

"Edit Breakpoint…" = "ブレークポイントを編集…";

"Enable Breakpoint" = "ブレークポイントを有効化";
"Disable Breakpoint" = "ブレークポイントを無効化";
"Delete Breakpoint" = "ブレークポイントを削除";

"Enable Breakpoints" = "ブレークポイントを有効化";
"Disable Breakpoints" = "ブレークポイントを無効化";
"Delete Breakpoints" = "ブレークポイントを削除";

"Double-click to edit a breakpoint" = "ブレークポイントをダブルクリックして編集";


// Console
"Console" = "コンソール";

"All Sources" = "すべてのソース";


// Reports
"Reports" = "レポート";
"Report" = "レポートする";

"Show Report…" = "レポートを表示…";
"No Report" = "レポートなし";


// Terminal
"Terminal" = "ターミナル";

"Local Terminal" = "ローカルターミナル";
"Remote Terminal" = "リモートターミナル";

"Local Shell" = "ローカルシェル";
"SSH" = "SSH";

"New Local Terminal" = "新規ローカルターミナル";
"New Remote Terminal" = "新規リモートターミナル";
"Quick Connect" = "クイックコネクト";
"Shared SSH Servers" = "共有SSHサーバ";

"Meta" = "メタ";
"Use Option as Meta Key" = "メタキーとしてOptionキーを使う";
"Clear Scrollback" = "スクロールバックを削除";

"Numeric Keypad Clear" = "Clear（テンキー）";
"F1" = "F1";
"F2" = "F2";
"F3" = "F3";
"F4" = "F4";
"F5" = "F5";
"F6" = "F6";
"F7" = "F7";
"F8" = "F8";
"F9" = "F9";
"F10" = "F10";
"F11" = "F11";
"F12" = "F12";
"F13" = "F13";
"F14" = "F14";
"F15" = "F15";
"F16" = "F16";
"F17" = "F17";
"F18" = "F18";
"F19" = "F9";
"← Cursor Left" = "← 左カーソル";
"↑ Cursor Up" = "↑ 上カーソル";
"→ Cursor Right" = "→ 右カーソル";
"↓ Cursor Down" = "↓ 下カーソル";
"↖︎ Home" = "↖︎ Home";
"↘︎ End" = "↘︎ End";
"⇞ Page Up" = "⇞ Page Up";
"⇟ Page Down" = "⇟ Page Down";
"⌦ Forward Delete" = "⌦ Forward Delete";
"⌫ Delete" = "⌫ Delete";

"⌥ Option" = "⌥ Option";
"⌃ Control" = "⌃ Control";
"⇧ Shift" = "⇧ Shift";
"⌃⌥ Control-Option" = "⌃⌥ Control-Option";
"⌃⌥⇧ Control-Option-Shift" = "⌃⌥⇧ Control-Option-Shift";
"⌥⇧ Option-Shift" = "⌥⇧ Option-Shift";
"⌃⇧ Control-Shift" = "⌃⇧ Control-Shift";

"Send Text" = "Send Text";
"Scroll Page Down" = "Scroll Page Down";
"Scroll Page Up" = "Scroll Page Up";
"Scroll to Top" = "Scroll to Top";
"Scroll to Bottom" = "Scroll to Bottom";
"Num Lock" = "Num Lock";

"Do you want to terminate the running processes in this terminal?" = "本当にこのターミナルで実行中のプロセスを終了しますか？";
"Closing this tab will terminate the running process %@." = "このタブを閉じると、実行中のプロセス %@ が終了します。";
"Closing this tab will terminate the running remote shell." = "このタブを閉じると、実行中のリモートシェルが終了します。";

"Send Text" = "Send Text";
"Scroll Page Down" = "Scroll Page Down";
"Scroll Page Up" = "Scroll Page Up";
"Scroll to Top" = "Scroll to Top";
"Scroll to Bottom" = "Scroll to Bottom";
"Num Lock" = "Num Lock";

"System Default" = "システムデフォルト";


// Quick Open
"Open Quickly" = "すばやく開く";
"Type a filename or symbol to quickly open it." = "すばやく開きたいファイル名やシンボルを入力します。";
"Type a filename to quickly open it." = "すばやく開きたいファイル名を入力します。";
"Type a symbol to quickly open it." = "すばやく開きたいシンボルを入力します。";

"Open Quickly from Tabs" = "タブからすばやく開く";
"Type a filename or symbol to quickly open tabs." = "ファイル名やシンボルを入力し、タブをすばやく開きます。";


// Commands
"Commands" = "コマンド";
"Type a command or menu item." = "コマンドやメニュー項目を入力します。";


// Text
"Text" = "テキスト";

"Gutter" = "ガター";

"Symbols" = "シンボル";
"Symbols in Open Tabs" = "開いているタブのシンボル";
"Current symbol: %@" = "現在のシンボル: %@";

"No symbols found in the current document." = "現在の書類からシンボルは見つかりませんでした。";
"No text document focused." = "選択されたテキストなし";

"Go To Symbol" = "シンボルに移動";

"(no symbol)" = "（シンボル無し）";

"Position" = "位置";
"Ln %@, Col %@" = "行 %@, 列 %@";
"Ln %@, Col %@ (%@)" = "行 %@, 列 %@ (%@)";
"Position: line %@, column %@" = "位置: 行 %@, 列 %@";
"Position: line %@, column %@, %@ selected characters" = "位置: 行 %@, 列 %@, 選択中 %@";

"Source Control status: %@ additions, %@ removals" = "ソース管理状況: %@ 追加、%@ 削除";

"Go To Line" = "行を指定して移動";
"Enter a line number (“12”) or line number and column (“12:30”) to jump to that position." = "行番号を数字で指定するか、列と共に指定（例: “12:30”）し、その位置にジャンプします。";

"Indentation" = "インデント設定";
"Spaces" = "スペース";
"Tabs" = "タブ";
"Tab Width" = "タブコード幅";
"Indent Level %ld" = "インデントレベル %ld";
"1 Space" = "1 スペース";
"%ld Spaces" = "%ld スペース";
"1 Tab" = "1 タブ"; // Textual tabs, as in whitespace
"%ld Tabs" = "%ld タブ"; // Textual tabs, as in whitespace
"Tabs (%ld sp)" = "タブ（%ld sp）"; // Textual tabs, as in whitespace
"Custom…" = "カスタム…";
"Autodetect" = "自動検出";

"Indent Selection" = "選択をインデント";
"Comment Selection" = "選択をコメントアウト";

"Comment Selection by Line" = "選択を1行コメントアウト";
"Comment Selection by Block" = "選択をブロックコメントアウト";

"Indentation Width" = "インデント幅";
"Enter the number of spaces to use for the indentation width." = "-インデント幅として指定したいスペース数を入力してください。";

"Line Endings" = "改行コード";
"Would you like to convert the old line endings in your document?" = "本当に現在の書類の改行コードを変換しますか？";
"Convert" = "変換";
"Just Switch" = "一時的に変更";

"This file has mixed line endings. Do you want to convert all line endings to %@, the most common line ending in the file?" = "このファイルには複数の改行コードが含まれています。このファイルで1番使われている改行コード %@ に統一しますか？";
"Other applications may not be able to read the file if you don't convert all line endings to the same type." = "改行コードを統一しない場合、他のアプリでこのファイルを読み込めない可能性があります。";
"Convert to %@" = "%@ に変換";

"Text Encoding" = "テキストエンコード";

"Do you want to reinterpret this document as “%@”, or just change the encoding?" = "この書類を“%@”として再解釈しますか？それともエンコードのみ変換しますか？";
"Reinterpreting will reopen the file using the new encoding, discarding any unsaved changes. Changing the encoding only affects how the file is written when next saved." = "再解釈すると新しいエンコードを使用してファイルが再度開かれ、保存されていない変更は破棄されます。エンコードのみを変換すると次回のファイル保存時、ファイルの書き込み方法に影響します。";
"Reinterpret" = "再解釈";
"Discard Changes & Reinterpret" = "変更を破棄して再解釈";
"Change Encoding Only" = "エンコードのみ変換";
"Change Text Encoding" = "テキストエンコードを変換";

"The document cannot be changed to the chosen encoding without losing information." = "書類の情報を失うことなく選択されたエンコードに変換することはできません。";
"Characters within the document may not be expressable in the encoding. You may wish to choose a different encoding which supports a wider character set." = "このエンコードでは書類内の文字をすべて表現できない可能性があります。より幅広い文字セットをサポートする別のエンコードの選択をお勧めします。";
"Change Anyway" = "強制的に変換";

"You are trying to insert characters which cannot be handled by the document's current encoding without losing information. Do you want to insert the characters anyway?" = "現在のエンコードでは情報を失うことなく処理できない文字を挿入しようとしています。それでも挿入しますか？";
"If you promote the document to a Unicode encoding you can insert the characters without losing information." = "Unicodeに変換することで、情報を失うことなく挿入できます。";
"Promote to UTF-16" = "UTF-16に変換";
"Promote to UTF-8" = "UTF-8に変換";

"Customize Encodings List…" = "エンコーディングリストをカスタマイズ…";

"No Selection" = "選択なし";

"Actions" = "アクション";
"Show Code Actions" = "コードアクションを表示";

"Jump to Definition" = "定義にジャンプ";
"Jump to Declaration" = "宣言にジャンプ";
"Jump to Type Definition" = "型定義にジャンプ";
"Jump to Implementations" = "実装にジャンプ";
"Jump to References" = "参照にジャンプ";

"Jump to Previous Occurrence" = "前のインスタンスにジャンプ";
"Jump to Next Occurrence" = "次のインスタンスにジャンプ";
"Select All Occurrences" = "すべてのインスタンスを選択";

"Show Quick Help" = "クイックヘルプを表示";

"Find in Project…" = "プロジェクト内を検索…";

"No Guesses Found" = "推測が見つかりません";
"Ignore Spelling" = "スペルを除外";
"Learn Spelling" = "スペルを学習";
"Unlearn Spelling" = "スペルを学習しない";

"Show Minimap" = "ミニマップを表示";
"Hide Minimap" = "ミニマップを隠す";

"Show Invisible Characters" = "不可視文字を表示";
"Hide Invisible Characters" = "不可視文字を隠す";

"Show Line Numbers" = "行番号を表示";
"Hide Line Numbers" = "行番号を隠す";

"Show Code Folding Ribbon" = "コード折り返しリボンを表示";
"Hide Code Folding Ribbon" = "コード折り返しリボンを隠す";

"Show Code Structure Headers" = "コード構造ヘッダを表示";
"Hide Code Structure Headers" = "コード構造ヘッダを隠す";

"Show Type and Function Separators" = "型と関数区切りを表示";
"Hide Type and Function Separators" = "型と関数区切りを隠す";

"Automatic Parsing Disabled" = "自動解析無効";
"The document “%@” exceeds the parsing file size limit. You can override this, but doing so may impact performance. Enable parsing at any time from the Editor → Syntax menu." = "書類 “%@” は解析可能なサイズ制限を超えています。無視することも可能ですが、パフォーマンスに影響します。メニュー: 書式 → 言語モードからいつでも有効にすることが可能です。";
"Always enable parsing for this file" = "このファイルの解析を常に有効にする";
"Enable Parsing" = "解析を有効にする";
"Disable Parsing" = "解析を無効にする";

"macOS / Unix (LF)" = "macOS / Unix (LF)";
"Mac OS Classic (CR)" = "Mac OSクラシック (CR)";
"Windows (CRLF)" = "Windows (CRLF)";

"Syntax Inspector" = "言語インスペクタ";
"Toggle the syntax inspector when hovering over code" = "コード上カーソルを置いた際の言語インスペクタを切り替える";
"Inspecting" = "検査しています";
"%@ chars" = "%@ 文字";
"Copy S-Expression" = "S式をコピー";

"Show Comparison" = "比較ビューを表示";
"Hide Comparison" = "比較ビューを隠す";

"Format Document" = "書類を整形";
"Format Selection" = "選択を整形";
"Format On Type" = "入力中に整形";


// Printing
"Grayscale" = "グレースケール";
"Printing Frame" = "印刷フレーム";
"Font" = "フォント";
"Letter Spacing" = "文字の間隔";
"Line Height" = "行の高さ";
"Line Numbers" = "行番号";
"Header and Footer" = "ヘッダとフッタ";
"Full File Path" = "ファイルのフルパス";
"Timestamp" = "タイムスタンプ";

"Simple" = "シンプル";
"Pizza Parlor" = "ピザパーラー";

"Date Last Saved" = "最終保存日時";
"Date Printed" = "プリント日時";


// Preview

"Preview" = "プレビュー";
"Preview In" = "ブラウザを指定してプレビュー";

"Open Preview in Tab" = "タブを開いてプレビュー";

"Split Preview Upward" = "上に分割してプレビュー";
"Split Preview Downward" = "下に分割してプレビュー";
"Split Preview Left" = "左に分割してプレビュー";
"Split Preview Right" = "右に分割してプレビュー";

"Preview Current Document" = "現在の書類をプレビュー";

"Cannot Preview Unsaved Document" = "未保存書類はプレビューできません";
"To preview this document in an external application, you must first save it." = "外部アプリケーションでプレビューする前に、書類を保存する必要があります。";

"Cannot Preview Document" = "書類をプレビューできません";
"The application with the bundle identifier “%@” could not be found." = "バンドル識別子“%@”を持つアプリが見つかりませんでした。";
"The default application for previewing URL “%@” could not be found." = "URL “%@”をプレビューするためのデフォルトアプリが見つかりませんでした。";

"Reload" = "再読み込み";

"Lock Focus to “%@”" = "選択を“%@”に固定";
"No previewable documents." = "プレビュー可能な書類はありません。";

"Stylesheets" = "スタイルシート";
"Scripts" = "スクリプト";
"No linked files could be found in the project." = "プロジェクトでリンクされているファイルが見つかりませんでした。";

"Show Web Inspector" = "ウェブインスペクタを表示";
"Hide Web Inspector" = "ウェブインスペクタを隠す";

"%@ can't open the specified address." = "%@ は指定されたアドレスを開けません。";

"Show certificate" = "証明書を表示";
"Connection is not secured with TLS." = "接続はTLSで保護されていません。";

"Allow “%@” to use your camera?" = "“%@”にカメラの使用を許可しますか？"; // %@ is a URL domain
"Allow “%@” to use your microphone?" = "“%@”にマイクの使用を許可しますか？"; // %@ is a URL domain
"Allow “%@” to use your camera and microphone?" = "“%@”にカメラとマイクの使用を許可しますか？"; // %@ is a URL domain

"Allow" = "許可";
"Don't Allow" = "許可しない";

"Web process terminated unexpectedly." = "ウェブプロセスが予期せず終了しました。";
"Reload the page to attempt to restart it." = "再起動するためにページを再読み込みしてください。";

"JavaScript alert from “%@”." = "“%@” からのJavaScript警告です。";

"Preview Server is running on port %d" = "プレビューサーバはポート %d で実行中です";
"Preview Server is not running" = "プレビューサーバは実行していません";
"Start Preview Server" = "プレビューサーバを開始";
"Stop Preview Server" = "プレビューサーバを終了";
"Copy Preview Server URL" = "プレビューサーバURLをコピー";

"AirPreview" = "AirPreview";


// Pops

"Color" = "カラー";
"Color Picker" = "カラーピッカー";

"COLOR_FORMAT_rgb" = "RGB";
"COLOR_FORMAT_hsl" = "HSL";
"COLOR_FORMAT_hsb" = "HSV";
"COLOR_FORMAT_p3" = "Display P3";
"COLOR_FORMAT_hex" = "Hex";
"COLOR_FORMAT_named" = "名前";

"sRGB" = "sRGB"; // The sRGB color space
"Display P3" = "Display P3"; // The Display P3 color space
"P3" = "P3"; // Shorthand for the Display P3 color space

"No Swatch Lists" = "見本リスト無し";

"New Swatch List…" = "新規見本リスト…";
"Duplicate…" = "複製…";
"Rename…" = "名前を変更…";
"Remove…" = "削除";

"Import…" = "読み込む…";
"Export…" = "書き出し…";

"Global" = "グローバル";

"Move List to Project" = "リストをプロジェクトに移動";
"Move List to Global" = "リストをグローバルに移動";

"The selected color space may not be fully representable on this screen. Colors may not appear accurate if they are outside of the gamut of your display device." = "選択された色空間はこの画面では完全に表現できない場合があります。ディスプレイの色域外にある場合、カラーが正確に表示されない場合があります。";


// Vim
"Vim" = "Vim";

"vim-normal" = "ノーマルモード";
"vim-insert" = "挿入";
"vim-visual" = "ビジュアル";
"vim-visual-line" = "行ビジュアル";
"vim-visual-block" = "矩形ビジュアル";
"vim-command" = "Command";
"vim-search" = "検索";
"vim-filter" = "検索";

// Vim Operators
"vim-change" = "変更";
"vim-delete" = "削除";
"vim-yank" = "ヤンク";
"vim-reindent" = "インデント";
"vim-replace" = "文字を置換";
"vim-shiftLeft" = "アウトデント";
"vim-shiftRight" = "インデント";
"vim-swapCase" = "大文字と小文字を変換";
"vim-lowercase" = "小文字にする";
"vim-uppercase" = "大文字にする";
"vim-register" = "レジスタを使う";
"vim-insertRegister" = "レジスタを挿入";
"vim-insertDigraph" = "ダイグラフを挿入";
"vim-insertLiteral" = "リテラルを挿入";

// Vim Modifiers
// "vim-modifier-around" = "--$$ STRING IS MISSING $$--";
// "vim-modifier-inside" = "--$$ STRING IS MISSING $$--";
// "vim-modifier-previous" = "--$$ STRING IS MISSING $$--";
// "vim-modifier-next" = "--$$ STRING IS MISSING $$--";
// "vim-modifier-afterPrevious" = "--$$ STRING IS MISSING $$--";
// "vim-modifier-beforeNext" = "--$$ STRING IS MISSING $$--";

// Vim Display Name Formats
"vim-nameFormat-register" = "レジスタ %1$@を使う…"; // RegisterName: e.g. "Using register f…"
"vim-nameFormat-register-action" = "レジスタ %1$@を使う: %2$@"; // RegisterName/Action: e.g. "Using register f: Yank…"

// "vim-nameFormat-operator-count-modifier" = "--$$ STRING IS MISSING $$--"; // Operator/Count/Modifier, e.g. "Yank 20x around…"
// "vim-nameFormat-operator-count" = "--$$ STRING IS MISSING $$--"; // Operator/Count, e.g. "Yank 20x…"
// "vim-nameFormat-modifier-count" = "--$$ STRING IS MISSING $$--"; // Modifier/Count, e.g. "Around 20x…"
// "vim-nameFormat-operator-modifier" = "--$$ STRING IS MISSING $$--"; // Operator/Modifier, e.g. "Yank around…"
// "vim-nameFormat-operator" = "--$$ STRING IS MISSING $$--"; // Operator, e.g. "Yank…"
// "vim-nameFormat-modifier" = "--$$ STRING IS MISSING $$--"; // Modifier, e.g. "Around…"
// "vim-nameFormat-count" = "--$$ STRING IS MISSING $$--"; // Count, e.g. "20x…"

// Vim Commands
"Enter an Ex command" = "Exコマンドを入力";


// Images and Media

"Image" = "画像";
"Audio" = "オーディオ";
"Video" = "ビデオ";
"Media" = "ファイル";
"PDF" = "PDF";

"Transparent" = "不透明度";
"Light Transparent" = "ライト不透明度";
"Dark Transparent" = "ダーク不透明度";
"Theme" = "テーマ";
"Black" = "黒";
"White" = "白";
"Gray" = "グレー";

"Play" = "転送完了時のサウンド";
"Pause" = "中断";

"Speed" = "スピード";
"Matte" = "マット";
"Zoom" = "拡大／縮小";

"Could not read the image data." = "画像データを読めませんでした。";


// Operations
"Ready" = "待機中";

"Connecting" = "接続中";
"Downloading" = "ダウンロード中";
"Uploading" = "アップロード中";
"Moving" = "移動中";
"Copying" = "コピー中";
"Deleting" = "削除中";
"Listing" = "リスト中";
"Renaming" = "リネーム中";
"Creating File" = "ファイル作成中";
"Creating Folder" = "フォルダ作成中";
"Archiving" = "アーカイブ中";
"Unarchiving" = "アーカイブ展開中";
"Changing Attributes" = "属性を変更中";
"Changing Directory" = "ディレクトリを変更中";
"Calculating Size" = "サイズを計算中";
"Transferring" = "転送中";

"Download Selected Items" = "選択された項目をダウンロード";
"Download Selected Items to “%@”" = "選択された項目を “%@” にダウンロード";
"Download “%@” to “%@”" = "“%@” を “%@” にダウンロード";

"Upload Selected Items" = "選択された項目をアップロード";
"Upload Selected Items to “%@”" = "選択された項目を “%@” にアップロード";
"Upload “%@” to “%@”" = "“%@” を “%@” にアップロード";

"Could not connect to “%@”." = "“%@” に接続できませんでした。";
"No additional information about the error was provided. (Error code %d)" = "エラーに関する追加情報は提供されませんでした。（エラーコード %d）";


// Source Control
"Source Control" = "ソース管理";
"Git" = "Git";
"Repository" = "リポジトリ";

"Git Accounts" = "Gitアカウント";

"You" = "あなた";
"(uncommitted)" = "（未コミット）";

"Clone via URL" = "URLからクローン";

"Changes" = "変更";
"History" = "履歴";
"Branches" = "ブランチ";
"Tags" = "タグ";
"Remotes" = "リモート";
"Submodules" = "サブモジュール";

"Show Last Change for Line" = "最終行の変更を表示";
"Show Last Change for Line Ignoring Whitespace" = "空白を無視して最終行の変更を表示";

"No Commits" = "コミットなし";

"Create New Local Branch" = "新規ローカルブランチを作成";
"Creates a new local branch from the remote branch “%@”." = "リモートブランチ “%@” から新規ローカルブランチを作成します。";
"Track Branch “%@”" = "ブランチ “%@” を追跡";
"Create Branch" = "ブランチを作成";

"Create Branch from “%@”…" = "“%@” からブランチを作成…";
"Create New Branch" = "新規ブランチを作成";
"Creates a new local branch from “%@”." = "“%@” からローカルブランチを作成します。";
"Checkout New Branch" = "新規ブランチをチェックアウト";

"Publish Branch" = "ブランチを公開";
"Creates a new remote branch on the selected remote." = "選択されたリモート上に新規リモートブランチを作成します。";
"Local Branch:" = "ローカルブランチ:";
"Remote:" = "リモート:";
"Track New Remote Branch" = "新規リモートブランチを追跡";
"Publish Branch" = "ブランチを公開";

"Create Tag from “%@”…" = "“%@” からタグを作成…";
"Create New Tag" = "新規タグを作成";
"Creates a new annotated tag from “%@”." = "“%@” から新規注釈付きタグを作成します。";
"Create Tag" = "タグを作成";
"Message:" = "メッセージ:";

"Commit" = "コミット";

"%@ (detached)" = "%@ （デタッチ済）";

"Commit to Detached HEAD" = "Detached HEADへコミット";
"You are currently working on a detached HEAD, which will not point to any branch. Commits made in this state will not appear in your commit history.\n\nIf this is not what you want, check out a branch before committing." = "現在detached HEADで作業しており、どのブランチも指していません。この状態でのコミットは履歴に表示されません。この状況が意図したもので無い場合、コミット前にブランチをチェックアウトしてください。";

"Are you sure you want to checkout “%@”?" = "本当に “%@” をチェックアウトしますか？";
"The repository will be placed in a detached HEAD state." = "リポジトリはデタッチされたHEADとなります。";

"Are you sure you want to cherry-pick “%@” onto “%@”?" = "本当に “%@” を “%@” にチェリーピックしますか？";
"The contents of this commit will be integrated into the current branch." = "このコミットは現在のブランチに統合されます。";
"Cherry-Pick" = "チェリーピック";

"Remotes" = "リモート"; // Where "Remote" is a Git repository remote URL
"Add Remote" = "リモートを追加"; // Where "Remote" is a Git repository remote URL
"Enter the name and URL of the remote to add for this repository." = "このリポジトリに追加するリモートの名前とURLを入力します。";
"URL:" = "URL:";

"Checkout Revision…" = "リビジョンをチェックアウト…";
"Checkout Revision" = "リビジョンをチェックアウト";
"Enter the revision, branch, tag, or reference you want to check out. Your local HEAD pointer will then be moved." = "チェックアウトしたいリビジョンやブランチ、タグ、参照を入力します。ローカルHEADポインタが移動します。";
"Revision:" = "リビジョン:";

"Current Version" = "現在のバージョン";
"Uncommitted Changes" = "未コミットの変更";
"Latest Commit" = "最新のコミット";
"Compared File" = "比較されたファイル";
"Compared Data" = "比較された日付";
"Compared Text" = "比較されたテキスト";

"Your Stuff" = "Your Stuff（ローカル）";
"Their Stuff" = "Their Stuff（リモート）";

"Loading comparison…" = "比較の読み込み中…";
"To compare against a file of your choice, click “Choose…” or drag it into this pane." = "任意のファイルと比較するには“選択…”をクリックするか、ここにファイルをドラッグします。";
"This file is not under source control." = "このファイルはソース管理下にありません。";
"This file has not yet been committed." = "このファイルは未コミットです。";
"Could not find this file in the commit's tree." = "コミットツリーにこのファイルは見つかりませんでした。";

"Choose a file for comparison…" = "比較するファイルを選択…";
"Compare" = "比較";

"Previous Change" = "前の変更";
"Next Change" = "次の変更";

"No changes" = "変更なし";
"1 change" = "変更 1";
"%@ changes" = "変更 %@";

"Ignore Whitespace" = "空白を無視";

"Checkout" = "チェックアウト";
"Fetch" = "フェッチ";
"Fetch from “%@”" = "“%@” からフェッチ";
"Pull" = "プル";
"Pull from “%@”" = "“%@” からプル";
"Push" = "プッシュ";
"Push…" = "プッシュ…";
"Push to “%@”" = "“%@” へプッシュ";

"Checkout “%@”" = "“%@” をチェックアウト";
"Fast-forward to “%@”" = "“%@” にFast-forward";
"Pull “%@”" = "“%@” をプル";
"Pull “%1$@” into “%2$@”" = "“%1$@” を “%2$@” にプル";
"Push “%1$@” to “%2$@”" = "“%1$@” を “%2$@” にプッシュ";
"Push “%@” to" = "“%@” を以下にプッシュ";
"Merge into “%@”…" = "“%@” にマージ…";

"Switch to “%@”…" = "-“%@” に切替…";
"Update “%@”…" = "“%@” を更新…";
"Move “%@”…" = "“%@” を移動…";
"Rename “%@”…" = "“%@” をリネーム…";
"Delete “%@”…" = "“%@”を削除…";

"Create New Branch from “%@”…" = "“%@” から新規ブランチを作成…";
"Create New Tag from “%@”…" = "“%@” から新規タグを作成…";
"Copy Branch Name" = "ブランチ名をコピー";
"Copy Tag Name" = "タグ名をコピー";

"Fetch “%@”…" = "“%@” をフェッチ…";
"Prune Obsolete Remote Branches" = "廃止されたリモートブランチをプルーン";
"Push All Tags to “%@”" = "すべてのタグを “%@” にプッシュ";

"Rename Branch" = "ブランチ名を変更";
"Enter a new name for this branch." = "このブランチの新しい名前を入力します。";

"Rename Remote" = "リモート名を変更";
"Enter a new name for this remote." = "このリモートの新しい名前を入力します。";

"Amend" = "修正";
"Amend %@" = "%@ を修正";

"Discard Change" = "変更を破棄";

"Discard Changes in %@ Items…" = "%@ 項目の変更を破棄…";
"Discard Changes in “%@”…" = "“%@” の変更を破棄…";
"Discard Changes in Selected Files…" = "選択されたファイルの変更を破棄…";

"Are you sure you want to discard uncommitted changes in “%@”?" = "本当に “%@” 内のコミットされていない変更を破棄しますか？"; // Single File
"Are you sure you want to discard uncommitted changes in %@ files?" = "本当に %@ のコミットされていない変更を破棄しますか？"; // Multiple files
"Discard" = "破棄";

"Item is untracked in the working tree" = "作業ツリーで追跡されていない項目";
"Item is added in the working tree" = "作業ツリーに追加された項目";
"Item is new in the index" = "Indexで新しい項目";
"Item is modified in the working tree" = "作業ツリーで変更された項目";
"Item is modified in the index" = "Indexで変更された項目";
"Item is deleted in the working tree" = "作業ツリーで削除された項目";
"Item is deleted in the index" = "Indexで削除された項目";
"Item is renamed in the working tree" = "作業ツリーでリネームされた項目";
"Item is renamed in the index" = "Indexでリネームされた項目";
"Item is type changed in the working tree" = "作業ツリーで形式変更された項目";
"Item is type changed in the index" = "Indexで形式変更された項目";
"Item is unreadable by source control" = "ソース管理で読み込めない項目";
"Item is in conflict in the working tree" = "作業ツリーで競合している項目";
"Item is ignored in the working tree" = "作業ツリーで無視されている項目";

// "%1$@ behind, %2$@ ahead of “%3$@”" = "--$$ STRING IS MISSING $$--";
// "%1$@ behind “%2$@”" = "--$$ STRING IS MISSING $$--";
// "%1$@ ahead of “%2$@”" = "--$$ STRING IS MISSING $$--";

"Stage" = "ステージング";
"Stage All" = "すべてをステージング";
"Unstage" = "ステージング解除";
"Unstage All" = "すべてをステージング解除";

"Stage Change" = "ステージング変更";

"Stage %@ Items" = "%@ 項目をステージング";
"Stage “%@”" = "“%@” をステージング";
"Stage Selected Files" = "選択されたファイルをステージング";

"Unstage %@ Items" = "%@ 項目をステージング解除";
"Unstage “%@”" = "“%@” をステージング解除";
"Unstage Selected Files" = "選択されたファイルをステージング解除";

"Message (press ⌘⏎ to commit)" = "メッセージ（⌘⏎ を押してコミット）";

"Merging" = "マージ中";

"Resolve all conflicts to complete this merge." = "このマージを完了するには、競合の解決が必要です。";
"Review the commit message and use “Commit” to complete this merge." = "コミットメッセージを確認し、“コミット”を使用してこのマージを完了します。";

"Abort Merge" = "マージを中断";
"Are you sure you want to abort the current merge?" = "本当に現在のマージを中断しますか？";

"Rebasing" = "リベース中";

"Resolve all conflicts to complete this rebase." = "このリベースを完了するには、競合の解決が必要です。";
"Review the commit message and use “Commit” to complete this rebase." = "コミットメッセージを確認し、“コミット”を使用してこのリベースを完了します。";

"Abort Rebase" = "リベースを中断";
"Are you sure you want to abort the current rebase?" = "本当に現在のリベースを中断しますか？";

"Cherry-Picking" = "チェリーピック中";

"Resolve all conflicts to complete this cherry-pick." = "このチェリーピックを完了するには、競合の解決が必要です。";
"Review the commit message and use “Commit” to complete this cherry-pick." = "コミットメッセージを確認し、“コミット”を使用してこのチェリーピックを完了します。";

"Abort Cherry-Pick" = "チェリーピックを中断";
"Are you sure you want to abort the current cherry-pick?" = "本当にこのチェリーピックを中断しますか？";

"Reverting" = "リバート中";

"Resolve all conflicts to complete this revert." = "このリバートを完了するには、競合の解決が必要です。";
"Review the commit message and use “Commit” to complete this revert." = "コミットメッセージを確認し、“コミット”を使用してこのリバートを完了します。";

"Abort Revert" = "リバートを中断";
"Are you sure you want to abort the current revert?" = "本当にこのリバートを中断しますか？";

"Applying Mailbox" = "適用中";

"Resolve all conflicts to complete this apply." = "この適用を完了するには、競合の解決が必要です。";
"Review the commit message and use “Commit” to complete this apply." = "コミットメッセージを確認し、“コミット”を使用してこの適用を完了します。";

"Abort Applying" = "適用を中断";
"Are you sure you want to abort the current apply?" = "-本当にこの適用を中断しますか？";

"The operation will be cancelled and any changes so far will be reverted to the previous state before the operation began." = "操作はキャンセルされ、これまでの変更は操作が開始される前の状態に戻ります。";

"This repository has no commits." = "このリポジトリにはコミットがありません。";
"Create one or more commits before pushing to a remote." = "リモートにプッシュする前に、1つ以上のコミットを作成してください。";

"Initialize Empty Repository…" = "空のリポジトリを初期化中…";
"Are you sure you want to initialize this project as a new Git repository?" = "本当にこのプロジェクトを新規Gitリポジトリとして初期化しますか？";
"The repository will be created at the root of this project's directory." = "リポジトリはプロジェクトディレクトリのルートに作成されます。";
"Initialize" = "初期化";

"Delete Branch" = "ブランチを削除";
"Are you sure you want to delete the branch “%@”?" = "本当にブランチ“%@”を削除しますか？";

"Delete Remote Branch" = "リモートブランチを削除";
"Are you sure you want to delete the branch “%1$@” from the remote “%2$@”?" = "本当にブランチ“%1$@”を、リモート“%2$@”から削除しますか？";

"Delete Remote" = "リモートを削除";
"Are you sure you want to delete the remote “%@”?" = "本当にリモート“%@”を削除しますか？";

"Delete Tag" = "タグを削除";
"Are you sure you want to delete the tag “%@”?" = "本当にタグ“%@”を削除しますか？";

"No Branches Found" = "ブランチは見つかりません";
"Select Destination…" = "保存先を選択…";

"Initializing submodules…" = "サブモジュールの初期化中…";
"Initializing submodule: %@" = "サブモジュールの初期化中: ";
"Stopping…" = "終了中…";
"The submodule “%@” could not be initialized." = "サブモジュール “%@” を初期化できませんでした。";
"Some submodules could not be initialized:" = "いくつかのサブモジュールを初期化できませんでした: ";
"Challenge from %@" = "%@ からのチャレンジ";
"Please enter the passphrase for %@." = "%@ のパスフレーズを入力してください。";

"No Git repository found." = "Gitリポジトリが見つかりません。";
"Initialize…" = "初期化する…";

"No branches or tags found." = "ブランチもしくはタグは見つかりませんでした。";
"No commits found." = "コミットは見つかりませんでした。";

"Source Control is not enabled." = "ソース管理が有効ではありません。";
"Enable Source Control" = "ソース管理を有効化";

"This repository is being rebased." = "このリポジトリはリベースされています。";
"This repository is being bisected." = "このリポジトリは分割されています。";
"This repository is in an unknown state." = "このリポジトリは不明な状態です。";
"This must be resolved outside of %@." = "これは %@ の外で解決する必要があります。";

"Failed to fast-forward branch." = "ブランチのfast-forwardに失敗しました。";

"Submodule has been added" = "サブモジュール追加";
"Submodule has been modified" = "サブモジュール変更";
"Submodule has been deleted" = "サブモジュール削除";
"Submodule contains uncommitted changes in its index or working directory" = "サブモジュールのインデックスまたは作業ディレクトリにコミットされていない変更が含まれています";
"Submodule contains untracked files in its working directory" = "サブモジュールの作業ディレクトリに追跡されていないファイルが含まれています";
"Submodule is uninitialized in the working directory" = "サブモジュールは作業ディレクトリで初期化されていません";

"Sign in to your %@ account" = "%@ にサインイン"; // Where %@ is the service name, e.g. "GitHub"
"Validating…" = "検証中…";
"Authorizing…" = "認証中…";

"Fetching Repositories…" = "リポジトリをフェッチ中…";
"Error fetching repositories: %@" = "リポジトリのフェッチ中エラー: %@";
"Open Accounts Preferences…" = "アカウント設定を開く…";


// Notifications
"Notifications" = "通知";


// Extensions
"Extension Library" = "機能拡張ライブラリ";
"Home" = "ホーム";

"Create New Extension" = "新規機能拡張を作成";
"Choose a location to save your new extension." = "新規機能拡張の保存先を選択してください。";
"Choose the type of extension:" = "機能拡張の形式を選択:";

"Extension Error" = "機能拡張エラー";
"The extension “%@” encountered an error the last time %@ was open. Do you want to disable it? You can enable it again in the Extensions preferences." = "機能拡張 “%@” は、前回 %@ を開いた際にエラーを検出しました。機能拡張を無効にしますか？環境設定から後で再度有効にすることも可能です。";
"One or more extensions encountered an error the last time %@ was open. Do you want to disable them? You can enable each one again in the Extensions preferences." = "前回 %@ を開いた際、1つ以上の機能拡張でエラーを検出しました。機能拡張を無効にしますか？環境設定から後で、それぞれを再度有効にすることも可能です。";
"Keep Enabled" = "有効のまま";
"Disable" = "無効にする";

"%@ issues may be reported at " = "%@ 問題が以下でレポートされました: ";

"Not available." = "利用できません。";
"This extension version is unavailable because it requires Nova %@ or later." = "この機能拡張は利用できません。Nova %@ 以降が必要です。";
"This extension version is unavailable because it requires Nova %@ or earlier." = "この機能拡張は利用できません。Nova %@ 以前が必要です。";
"This extension version is unavailable because it has been disabled by the Panic team." = "この機能拡張は利用できません。Panicにより無効化されました。";

"by %@" = "by %@"; // Author, as in "by User Name"
"Version %@" = "バージョン %@"; // Version string, as in "Version 1.0"
"v%@" = "v%@"; // Version string, as in "v1.0"
"%@ ago" = "%@前"; // As in "1 day ago"
"(no description)" = "（説明なし）";

"Back / Forward" = "戻る／進む";
"Search for New Extensions" = "機能拡張を検索";

"Go to the previous page" = "前のページへジャンプ";
"Go to the next page" = "次のページへジャンプ";
"Go to the homepage" = "ホームページへジャンプ";

"Development Extensions" = "機能拡張の開発";
"Installed Extensions" = "インストール済機能拡張";
"Built-In Packages" = "ビルトインパッケージ";

"Install" = "インストール";
"Uninstall" = "アンインストール";
"Deactivate" = "無効化";
"Update" = "更新";
"Update All" = "すべてアップデート";
"Not Installed" = "未インストール";
"Enable" = "有効にする";
"Disable" = "無効にする";

"Copy Link" = "リンクをコピー";

"Extension Not Installed" = "機能拡張はインストールされませんでした";
"Show in Extension Library…" = "機能拡張ライブラリを表示…";
"Check For Updates…" = "アップデートを確認…";
"Check for extension updates" = "機能拡張アップデートを確認";
"Version %@ available, you have version %@." = "バージョン %@ が利用可能で、現在のバージョンは %@ です。";

"Results for “%@”" = "“%@” の結果";
"No Results for “%@”" = "“%@” の結果なし";

"Featured" = "注目";
"Most Popular: %@" = "もっとも人気: %@";
"All" = "すべて";
"All Time" = "全期間";
"This Week" = "今週";
"This Month" = "今月";
"Recently Added" = "新登場";
"Recently Updated" = "最近のアップデート";

"1 Install" = "インストール数 1"; // Number of downloads / installations, singular
"%@ Installs" = "インストール数 %@"; // Number of downloads / installations, such as "12 Installs"

"No extensions installed." = "機能拡張はインストールされていません。";
"Discover new extensions using the search field above." = "上の検索欄から機能拡張を探索してみましょう。";

"Fetching Extension Details…" = "機能拡張の詳細を取得中…";

"Extension Not Found" = "機能拡張が見つかりません";
"An extension matching “%@” could not be found in the Extension Library." = "機能拡張ライブラリでは “%@” にマッチする機能拡張を見つけられませんでした。";

"Uninstall “%@”?" = "“%@” をアンインストール？";
"The extension and its functionality will be disabled and removed. Any windows using the extension will be reconfigured accordingly." = "提供されていただ機能は無効になり、機能拡張は削除されます。ウインドウはそれに応じて再構成されます。";

"Do you want to install the extension “%@”, or open it for editing?" = "機能拡張 “%@” をインストールしますか？それとも編集のために開きますか？";
"Do you want to install %@ extensions, or open them for editing?" = "“%@” 機能拡張をインストールしますか？それとも編集のためにそれらを開きますか？";
"Installing an extension will load it and enable its features. Opening it for editing will create a new project window for the extension's contents." = "機能拡張をインストールすると読み込まれ、機能が利用可能になります。編集のために開くと、専用の新しいプロジェクトウインドウが現れます。";
"Open for Editing" = "編集のために開く";

"Extension Service Quit Unexpectedly" = "予期せず機能拡張が終了しました";
"An issue with one or more extensions caused the service to terminate. As a result, all extensions will need to reload." = "機能拡張の問題によりサービスが終了しました。そのため、すべての機能拡張を再度読み込む必要があります。";
"You may optionally disable extensions until the next application launch." = "次回起動時まで機能拡張を無効にするオプションも利用可能です。";
"The following extensions were executing when the crash occurred:" = "クラッシュ時に以下の機能拡張が実行されていました:";
"Disable Until Relaunch" = "再起動まで無効にする";

"The extension “%@” has stopped responding." = "機能拡張 “%@” は応答を停止しました。";
"You can attempt to interrupt this extension or wait for it completes its work. You can also choose to disable this extension in this workspace until the next time it's opened." = "この機能拡張を中断するか、作業の完了を待つことができます。 このワークスペースでこの拡張機能を次回まで無効にすることも可能です。";
"Wait" = "待機する";
"Interrupt" = "中断する";
"Interrupt & Disable" = "中断して無効化";

"Extension Reloaded" = "機能拡張を再読み込み";
"The extension “%@” was reloaded due to a file change." = "ファイルの変更により機能拡張 “%@” が再読み込みされました。";

"Extension Failed to Reload" = "機能拡張の再読み込みに失敗";
"The extension “%@” could not be reloaded because of one or more issues." = "何らかの問題により機能拡張 “%@” が再読み込みに失敗しました。";

"Another extension with the identifier “%@” is already loaded." = "識別子 “%@” の別の機能拡張がすでに読み込まれています。";
"Try disabling or removing the existing extension." = "既存の機能拡張を無効化、または削除してみてください。";

"Extension “%@” Not Installed" = "機能拡張 “%@” はインストールされていません";

"Extension Console" = "機能拡張コンソール";

"Configure Themes…" = "テーマを構成する…";

"Reporting abuse for %@ (%@)" = "%@ (%@) の不正使用を報告";
"Please describe the reason that this extension should be reviewed:" = "この機能拡張を確認するべき理由をご説明ください:";

"Choose the folder containing a Tree-sitter grammar." = "Tree-sitter文法を含むフォルダを選択します。";


// Extension Authoring
"Sign In" = "サインイン";
"Sign Out" = "サインアウト";

"EXTENSION_ACCOUNT_SIGNUP_URL" = "https://extensions.panic.com/users/signup/";
"EXTENSION_ACCOUNT_PASSWORD_RECOVERY_URL" = "https://extensions.panic.com/password_reset/";

"Not signed in" = "未サインイン";

"Sign in with your Nova developer account to submit to the extension library." = "機能拡張ライブラリに提出するには、Nova開発者アカウントでサインインします。";

"Two-Factor Authentication" = "2ファクタ認証";
"Your account is protected by two-factor authentication. Enter the code generated by your authorization app." = "あなたのアカウントは2ファクタ認証で保護されています。認証アプリで生成されたコードを入力してください。";

"No Organizations Found" = "組織が見つかりません";
"Register New Organization…" = "新規組織を登録する…";

"Verify Extension for Submission" = "提出する機能拡張を検証";
"Let's validate the contents of your extension before submission." = "提出前にあなたの機能拡張を検証しましょう。";

"Ready to Submit Extension" = "機能拡張の提出準備完了";
"Your extension has been validated and is ready to submit." = "あなたの機能拡張が検証され、提出準備が整いました。";

"Submitting to the Extension Library" = "機能拡張ライブラリに提出";
"Your extension is being packaged and delivered to the library." = "あなたの機能拡張はパッケージ化され、ライブラリに提出されます。";

"No issues found." = "問題は見つかりませんでした。";
"Requesting status from the Extension Library…" = "機能拡張ライブラリから状況のリクエスト中…";

"Packaging extension…" = "機能拡張をパッケージ中…";
"Uploading extension…" = "機能拡張をアップロード中…";

"Submit" = "提出";

"Your extension was successfully submitted!" = "あなたの機能拡張の提出は成功しました！";


// Updates
"%@ is up to date." = "%@ は最新です。";
"Check for Updates" = "アップデートを確認";
"Check for Updates…" = "アップデートを確認…";
"Checking for Updates…" = "アップデートを確認中…";
"The updater encountered an error." = "アップデートでエラーが発生しました。";
"Downloading Update…" = "アップデートをダウンロード中…";
"Install Update" = "アップデートをインストール";
"Install Update…" = "アップデートをインストール…";
"Installing Update…" = "アップデートをインストール中…";

"A new beta is available." = "新しいベータ版が利用可能です。";
"A new update is available." = "新しいアップデートが利用可能です。";
"Update Ready!" = "アップデート準備完了！";

"Install & Restart" = "インストールして再起動";
"Buy Now" = "今すぐ購入";
"Renew Now" = "今すぐ更新";
"Don't notify me of these updates." = "これらの更新を通知しない。";
"Opt-out of beta updates." = "ベータ版をオプトアウトします。";

"Learn More." = "より詳しい情報。";
"More Info…" = "より詳しい情報…";

"%1$@ %2$@ is available!" = "%1$@ %2$@ が利用可能です！";
"A new version of %@ is available!" = "%@ の新しいバージョンが利用可能です！";
"%1$@ %2$@ is now available — you have %3$@.\nThis update will be installed automatically when you quit %1$@." = "%1$@ %2$@ が利用可能で、%3$@ をお持ちです。\nこのアップデ ー トは %1$@ を終了すると自動的に開始されます。";
"%1$@ %2$@ is now available — you have %3$@, but your year of free updates ended on %4$@. To continue getting updates, buy the latest version of %1$@ and you'll get another year of fixes and new features." = "%1$@ %2$@が利用可能になりました。%3$@をお持ちですが無料のアップデート期間は%4$@に終了しています。アップデートを継続するには%1$@の最新版をお求めください。1年間、修正や機能追加が提供されます。";

"%1$@ %2$@ is available for testing!" = "%1$@ %2$@ がテスト利用可能です！";
"A new beta of %@ is available for testing!" = "%@ の新しいベータ版がテスト利用可能です！";
"%1$@ %2$@ is now available — you have %3$@.\nSince you are not currently using a beta version,\nthis won't be installed automatically." = "%1$@ %2$@ が利用可能で、%3$@ をお持ちです。\n現在ベータ版を使用していないため、\n自動的にインストールされません。";

"Release Notes" = "リリースノート";
"Release Notes: %@" = "リリースノート: ";


// Problem Reporter
"Problem Report" = "問題レポート";
"Report a bug or other issue with Nova." = "Novaに関する問題や気になることをレポートします。";

"Feature Request" = "機能リクエスト";
"Provide feedback for a new feature or enhancement to Nova." = "Novaに期待する新機能をフィードバックします。";

"Provide feedback for this extension in its issue tracker." = "この機能拡張に関するフィードバックをします。";


// Servers
"ProtocolDescriptionSFTP" = "SSH / SFTP";
"ProtocolDescriptionFTPTLS" = "FTP with TLS/SSL";
"ProtocolDescriptionFTPSSL" = "FTP with Implicit SSL";
"ProtocolDescriptionFTP" = "FTP";
"ProtocolDescriptionAmazonS3" = "Amazon S3";
"ProtocolDescriptionAmazonS3IAM" = "Amazon S3 with IAM Role";
"ProtocolDescriptionOneDrive" = "Microsoft OneDrive";
"ProtocolDescriptionOneDriveForBusiness" = "Microsoft OneDrive for Business";
"ProtocolDescriptionAzure" = "Microsoft Azure";
"ProtocolDescriptionDreamObjects" = "DreamObjects";
"ProtocolDescriptionDropbox" = "Dropbox";
"ProtocolDescriptionGoogleDrive" = "Google Drive";
"ProtocolDescriptionBox" = "Box";
"ProtocolDescriptionRackspace" = "Rackspace Cloud Files";
"ProtocolDescriptionOpenStack" = "OpenStack Swift";
"ProtocolDescriptionWebDAVS" = "WebDAV HTTPS";
"ProtocolDescriptionWebDAV" = "WebDAV";
"ProtocolDescriptionBackblazeB2" = "Backblaze B2";

"server.com" = "入力例: server.com";

"objects-us-east-1.dream.io" = "入力例: objects-us-east-1.dream.io";
"onedrive.com" = "入力例: onedrive.com";
"sharepoint.com" = "入力例: sharepoint.com";
"dropbox.com" = "入力例: dropbox.com";
"drive.google.com" = "入力例: drive.google.com";
"box.com" = "入力例: box.com";
"office365.com" = "入力例: office365.com";
"microsoft.azure.com" = "入力例: microsoft.azure.com";
"identity.api.rackspacecloud.com" = "入力例: identity.api.rackspacecloud.com";
"api.backblazeb2.com" = "入力例: api.backblazeb2.com";
"s3.amazonaws.com" = "入力例: s3.amazonaws.com";
"sts.amazonaws.com" = "入力例: sts.amazonaws.com";

"New Server Group" = "新規サーバグループ";

"Untitled Server" = "名称未設定サーバ";

"Export Encrypted Servers" = "サーバ設定を暗号化して書き出す";
"Enter a passphrase to use to encrypt the exported servers. This passphrase will be required when importing the servers." = "書き出すサーバ設定の暗号化に使用するパスフレーズを入力してください。このパスフレーズはサーバ設定を読み込む際に必要になります。";

"Import Encrypted Servers" = "暗号化されたサーバ設定を読み込む…";
"Enter the passphrase used to encrypt the exported servers." = "書き出すサーバ設定の暗号化に使用したパスフレーズを入力してください。";
"The passphrase entered did not match the encrypted data. Enter the passphrase used to encrypt the exported servers." = "入力されたパスフレーズは暗号化データとマッチしませんでした。暗号化されたサーバ設定を書き出した際のパスフレーズを入力してください。";

"Export Servers…" = "サーバ設定を書き出す…";
"Export Selected Servers…" = "選択されたサーバ設定を書き出す…";

"Add New Server" = "新規サーバを追加";
"Manage Servers…" = "サーバを管理";

"Connecting…" = "接続中…";
"Connect via %@" = "%@ で接続";

"Enter a name for the server and choose where to keep it." = "サーバ設定名を入力し保存先を選択してください。";

"copy a server password to the pasteboard" = "ペーストボードにサーバパスワードをコピー"; // Intentionally not capitalized for formatting by LAContext

"Closest Geographical Endpoint" = "最も近所のエンドポイント";


// Panic Sync
"Your servers and keys can automatically sync between Nova, Transmit, and Coda. It's free, secure, and easy." = "あなたのサーバ接続設定と認証鍵をNova、Transmit、Coda間で自動的に同期します。セキュアで簡単、無料です。";


// Transfers
"Transfers" = "転送";

"Source Control Files (Example)" = "ソース管理ファイル（サンプル）";


// Keys

"Select the key files to import." = "読み込む認証鍵を選択してください。";
"Could not import SSH key file “%@”." = "SSH 認証鍵 “%@” を読み込めませんでした。";
"The file is not in a supported format." = "ファイルは未サポートの形式です。";

"Would you like to save the passphrase for “%@” in Keychain?" = "“%@” のパスフレーズをキーチェーンに保存しますか？";
"A passphrase is required for this encrypted key." = "この暗号化された鍵にはパスフレーズが必要です。";

"Would you like to copy the key to the Clipboard?" = "クリップボードにコピーしますか？";
"The selected part of the key will be put on the Clipboard." = "選択された認証鍵をクリップボードにコピーします。";
"Copy Public Key" = "公開鍵をコピー";
"Copy Private Key" = "秘密鍵をコピー";

"New Key" = "新規認証鍵";
"Automatic" = "自動";

"No Keys" = "認証鍵の選択";
"Manage Keys…" = "認証鍵の管理…";

"SSH_KEYS_HELP_URL" = "https://library.panic.com/ja/general/ssh-keys/";


// Key Bindings
"Key Bindings" = "キーバインド";

"Manage Key Bindings…" = "キーバインドを管理…";
"New Set from Template" = "テンプレートから新規作成";

"%@ (customized)" = "%@（カスタム済）";

"%@ is bound to %@" = "%@ から %@ へ";

"Customized" = "カスタム済";
"Conflicts" = "競合";

"%@ Menu" = "%@ メニュー";
"Extensions Menu for %@" = "%@ の機能拡張メニュー";
"Editor Menu for %@" = "%@ のエディタメニュー";

"Default Shortcut: %@" = "デフォルト: %@";
"Default Shortcuts: %@" = "デフォルト: %@";
"%@ is bound to “%@”. Custom shortcuts will be preferred." = "%@ から “%@” へカスタムされ、このショートカットが優先されます。";
"%@ is bound to %@ other commands. Custom shortcuts will be preferred." = "%@ は他の %@ へカスタムされ、このショートカットが優先されます。";
"System shortcuts may take precedence over this shortcut." = "システムのショートカット設定がこのショートカットよりも優先されることがあります。";
"Open System Settings…" = "システム環境設定を開く…";


// Text Action Key Bindings

// "Center Selection in Visible Area" = "--$$ STRING IS MISSING $$--";
// "Scroll Line Up" = "--$$ STRING IS MISSING $$--";
// "Scroll Line Down" = "--$$ STRING IS MISSING $$--";
// "Scroll to Beginning of Document" = "--$$ STRING IS MISSING $$--";
// "Scroll to End of Document" = "--$$ STRING IS MISSING $$--";
// "Scrolling" = "--$$ STRING IS MISSING $$--";
// "Delete to Mark" = "--$$ STRING IS MISSING $$--";
// "Select to Mark" = "--$$ STRING IS MISSING $$--";
// "Swap with Mark" = "--$$ STRING IS MISSING $$--";
// "Set Mark" = "--$$ STRING IS MISSING $$--";
"Yank" = "ヤンク";
// "Yank and Select" = "--$$ STRING IS MISSING $$--";
// "Mark & Yank" = "--$$ STRING IS MISSING $$--";
// "Move Up" = "--$$ STRING IS MISSING $$--";
// "Move Down" = "--$$ STRING IS MISSING $$--";
// "Move Up Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move Down Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move Left" = "--$$ STRING IS MISSING $$--";
// "Move Right" = "--$$ STRING IS MISSING $$--";
// "Move Forward" = "--$$ STRING IS MISSING $$--";
// "Move Backward" = "--$$ STRING IS MISSING $$--";
// "Move Left Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move Right Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move Forward Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move Backward Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move Word Left" = "--$$ STRING IS MISSING $$--";
// "Move Word Right" = "--$$ STRING IS MISSING $$--";
// "Move Word Forward" = "--$$ STRING IS MISSING $$--";
// "Move Word Backward" = "--$$ STRING IS MISSING $$--";
// "Move Word Left Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move Word Right Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move Word Forward Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move Word Backward Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move Subword Left" = "--$$ STRING IS MISSING $$--";
// "Move Subword Right" = "--$$ STRING IS MISSING $$--";
// "Move Subword Left Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move Subword Right Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move to Beginning of Line" = "--$$ STRING IS MISSING $$--";
// "Move to End of Line" = "--$$ STRING IS MISSING $$--";
// "Move to Left End of Line" = "--$$ STRING IS MISSING $$--";
// "Move to Right End of Line" = "--$$ STRING IS MISSING $$--";
// "Move to Beginning of Line Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move to End of Line Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move to Left End of Line Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move to Right End of Line Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move to Beginning of Paragraph" = "--$$ STRING IS MISSING $$--";
// "Move to End of Paragraph" = "--$$ STRING IS MISSING $$--";
// "Move to Beginning of Paragraph Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move to End of Paragraph Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move Paragraph Forward Extending Selection" = "--$$ STRING IS MISSING $$--";
// "Move Paragraph Backward Extending Selection" = "--$$ STRING IS MISSING $$--";
"Selection" = "選択";
// "Insert Newline" = "--$$ STRING IS MISSING $$--";
// "Insert Newline without Extra Action" = "--$$ STRING IS MISSING $$--";
"Insert Tab" = "Tabの挿入";
// "Insert Tab without Extra Action" = "--$$ STRING IS MISSING $$--";
// "Insert Backtab" = "--$$ STRING IS MISSING $$--";
// "Insertions and Indentations" = "--$$ STRING IS MISSING $$--";
// "Delete Forward" = "--$$ STRING IS MISSING $$--";
// "Delete Backward" = "--$$ STRING IS MISSING $$--";
// "Delete Word Forward" = "--$$ STRING IS MISSING $$--";
// "Delete Word Backward" = "--$$ STRING IS MISSING $$--";
// "Delete Subword Forward" = "--$$ STRING IS MISSING $$--";
// "Delete Subword Backward" = "--$$ STRING IS MISSING $$--";
// "Delete to Beginning of Line" = "--$$ STRING IS MISSING $$--";
// "Delete to End of Line" = "--$$ STRING IS MISSING $$--";
// "Delete to Beginning of Paragraph" = "--$$ STRING IS MISSING $$--";
// "Delete to End of Paragraph" = "--$$ STRING IS MISSING $$--";
"Deletions" = "削除";


// Preferences
"Preferences" = "環境設定";
"Settings" = "設定";

"Preferences…" = "環境設定…";
"Settings…" = "設定…";

"General" = "一般";
"Accounts" = "アカウント";
"Behaviors" = "挙動設定";
"Files" = "ファイル";
"Editor" = "書式";
"Completions" = "コード補完";
"Theme" = "テーマ";
"Extensions" = "機能拡張";
"Tools" = "ツール";
"Advanced" = "詳細設定";
"Servers" = "サーバリスト";
"Keys" = "認証鍵";

"Default: %@" = "デフォルト: %@";


// General Preferences
"Launcher options" = "ランチャーオプション";
"Projects" = "プロジェクト";

"Crash Reports" = "クラッシュレポート";
"Analytics" = "アナリティクス";
"Privacy" = "プライバシー";
"Data Collection" = "データ収集";

"Software Updates" = "ソフトウェアアップデート";

"Beta Updates" = "ベータアップデート";
"By opting-in, you acknowledge that betas are pre-release software and you may encounter unexpected bugs or behaviors, including data loss." = "ベータ版はプレリリースソフトウエアであり、予期しない動作やバグ、データの損失が起こる可能性があることに同意するものとします。";
"I Understand" = "理解しました";

"Extension Development" = "機能拡張の開発";

"Help Panic improve %@." = "%@ の改良にご協力ください。";
"PrivacyURL" = "https://panic.com/jp/privacy";

"Are you sure you want to disable Nova announcements?" = "本当にNovaからのお知らせを無効にしますか？";
"These are meant to inform you about important Nova-related news, and are for exceptional circumstances only." = "これはNovaに関する重要なニュースをお知らせするためのもので、例外的な場合にのみ適用されます。";

"SoapboxPrivacyURL" = "https://panic.com/jp/privacy/#soapbox";

// Accounts Preferences
"Manage %@ accounts" = "アカウント%@を管理";

// Editor Preferences
"Custom File Type" = "カスタムファイル形式";
"File Extension" = "ファイル拡張子";
"Filename / Extension" = "ファイル名 / 拡張子";

"Syntax" = "言語モード";
"Plain Text" = "標準テキスト";

"Insertion Point" = "挿入ポイント";
"Line Numbers" = "行番号";
"Code Folding" = "コードの折りたたみ";
"Editor Path Bar" = "エディタパスバー";
"Type and function separators" = "入力と機能セパレータ";
"Code Structure Headers" = "コード構造ヘッダ";
"Sticky Code Headers" = "スティッキーコードヘッダ";
"Minimap" = "ミニマップ";
"Map" = "マップ";
"Invisible Characters" = "不可視文字の表示";
"Line Highlight" = "選択行ハイライト";
"Editor Status View" = "エディタステータス表示";
"Editor Font options" = "エディタフォントオプション";
"Editor Overscroll" = "エディタオーバースクロール";
"Bracket Palette" = "カッコパレット";
"Color Previews" = "カラーのプレビュー";
"Default Text Encoding" = "デフォルトのテキストエンコード";
"Default Line Endings" = "デフォルトの改行コード";
"Comment options" = "コメントオプション";
"EditorConfig options" = "EditorConfigオプション";
"Preview options" = "プレビューオプション";
"Breakpoint options" = "ブレークポイントオプション";

"Default Syntax" = "デフォルト言語モード";
"Custom File Types" = "カスタムファイル形式";
"Completion options" = "コード補完オプション";
"Autocomplete options" = "自動補完オプション";
"Language Server options" = "言語サーバオプション";

"Indentation options" = "インデントオプション";
"Indentation Guides" = "インデントガイド";
"Adjust indentation while typing" = "入力中のインデント調整";
"Reformat indentation of pasted text" = "挿入テキストに応じてインデントを調整";

"Git Change Markers" = "Git変更マーク";
"Git Authors" = "Git作成者";
"Git Blame" = "Git Blame";

// Behavior Preferences
"New Behavior" = "新規挙動設定";
"Manage Behaviors…" = "挙動設定を管理…";
"No Custom Behaviors" = "カスタム挙動設定なし";
"Choose Sound…" = "サウンドを選択…";
"Choose Script…" = "スクリプトを選択…";

"Manage notifications for project events" = "プロジェクトのイベント通知管理";

// Key Bindings Preferences
"The key combination “%@” is already in use by “%@”." = "キーの組み合わせ “%@” はすでに “%@” で使われています。";
"The key combination “%@” is not valid." = "キーの組み合わせ “%@” は無効です。";

"Keyboard shortcuts for custom behaviors must not conflict with existing menu items. Please choose another keyboard shortcut." = "カスタム挙動設定のキーボードショートカットは、既存のメニュー項目と競合できません。別のキーボードショートカットを選択してください。";
"Keyboard shortcuts for custom behaviors must include the Command (⌘) modifier. Please choose another keyboard shortcut." = "カスタム挙動設定のキーボードショートカットは command（⌘）キーを含める必要があります。別のキーボードショートカットを選択してください。";

// Behaviors Preferences
"Starts" = "開始";
"Pauses" = "停止";
"Generates issues" = "問題を生成";
"Generates output" = "出力を生成";
"Succeeds" = "成功";
"Fails" = "失敗";
"Completes" = "完了";
"Exits unexpectedly" = "突然終了";

// Workspace Preferences
"Sidebar Layouts" = "サイドバーレイアウト";
"Sidebar Dock options" = "サイドバーDockオプション";
"Default Split Direction" = "デフォルトの分割方向";
"Open documents with a single-click" = "シングルクリックで書類を開く";
"Automatically select focused files" = "フォーカスされたファイルを自動選択";
"Automatically save documents" = "閉じる際に書類を自動保存";
"Save files atomically" = "-ファイルをアトミック保存";
"Atomic Save" = "アトミック保存";
"Markdown Preview options" = "マークダウンプレビューオプション";

// Files Preferences
"Files Sidebar View options" = "ファイルサイドバー表示オプション";
"Files Sidebar Navigation Controls" = "ファイルサイドバーナビゲーションコントロール";
"Find Pasteboard options" = "検索ペーストボードオプション";
"Dragging and Dropping Files" = "ファイルのドラッグアンドドロップ";
"Ignored Files" = "除外ファイル";

// Terminal Preferences
"Terminal Font options" = "ターミナルフォントオプション";
"Terminal Beep" = "ベルのスタイル";
"Terminal Title options" = "タイトルオプション";

"Terminal Theme" = "ターミナルテーマ";
"Terminal ANSI Colors" = "ANSIカラー";

"Terminal Keyboard options" = "キーボードオプション";

"Terminal Type" = "ターミナルタイプ";
"Terminal Mouse Events" = "マウスイベント";
"Terminal Data Detectors" = "データ検出";

// Theme Preferences
"Themes" = "テーマ";

"Window Theme" = "ウインドウテーマ";
"Editor Theme" = "エディタテーマ";
"Dock Icon" = "Dockアイコン";

// Servers Preferences
"File Servers" = "ファイルサーバ";

// Keys Preferences
"SSH Keys" = "SSH認証鍵";
"Private Keys" = "秘密鍵";

// Transfers Preferences
"File Transfer options" = "ファイル転送オプション";
"Cloud options" = "クラウドオプション";
"File Transfer Rules" = "ファイル転送ルール";
"File Transfer Proxy options" = "ファイル転送プロキシオプション";
"Advanced File Server options" = "上級ファイルサーバオプション";

// Tools Preferences
"Command Line Tool" = "コマンドラインツール";
"CLI tool" = "CLIツール";
"Environment Variables" = "環境変数";


// Tools

"%@ would like to install its command line tools in /usr/local/bin." = "%@ はコマンドラインツールを /usr/local/bin にインストールしようとしています。";
"%@ would like to uninstall its command line tools from /usr/local/bin." = "%@ はコマンドラインツールを /usr/local/bin からアンインストールしようとしています。";


// Help

"NOVA_HOMEPAGE_URL" = "/jp";
"NOVA_BUY_PAGE_URL" = "/jp/buy";
"NOVA_LICENSE_HELP_URL" = "/jp/help";
"NOVA_BUG_REPORTING_URL" = "/jp/help";
"NOVA_RELEASE_NOTES_URL" = "/jp/releases";

"NOVA_LICENSE_MANAGE_URL" = "https://accounts.panic.com/";
"NOVA_REFERENCE_LIBRARY_URL" = "https://library.panic.com/ja/nova";
"NOVA_REFERENCE_LIBRARY_SEARCH_URL" = "https://library.panic.com/search.php";

"PANIC_ELIST_SIGNUP_URL" = "https://elist.panic.com/";

"Error fetching topics from Panic Library" = "Panicライブラリからトピック取得中にエラーが発生しました";


// Launcher

"Recent" = "最近の項目";
"Servers" = "サーバリスト";
"No projects." = "プロジェクトなし。";
"Remove Project" = "プロジェクトを削除";
"Remove Projects" = "プロジェクトを削除";
"New Project" = "新規プロジェクト";
"Open…" = "開く…";
"Search projects" = "プロジェクトを検索";
"Search remote projects" = "リモートプロジェクトを検索";
"Search local projects" = "ローカルプロジェクトを検索";

"New Group" = "新規グループ";

"Back to Projects" = "プロジェクトに戻る";
"Move to Projects" = "プロジェクトに移動";
"Remove from Projects" = "プロジェクトリストから削除";

"Locate…" = "場所…";

"The project “%@” could not be opened." = "プロジェクト “%@” を開けませんでした。";
"Some projects could not be opened." = "いくつかのプロジェクトを開ませんでした。";
"The selected projects could not be opened." = "選択されたプロジェクトを開ませんでした。";
"The project “%@” could not be located." = "プロジェクト “%@” を見つけられませんでした。";
"Some projects could not be located." = "いくつかのプロジェクトを見つけられませんでした。";
"The selected projects could not be located." = "選択されたプロジェクトを見つけられませんでした。";
"Volume “%@” is unavailable." = "ボリューム “%@” は利用できません。";
"The file or folder was not found." = "ファイルかフォルダを見つけられませんでした。";
"The item is not a directory." = "この項目はディレクトリではありません。";
"Are you sure you want to remove %lu projects?" = "本当に %lu プロジェクトを削除しますか？";
"No files or servers will be deleted." = "ファイルやサーバ設定は削除されません。";
"This action will only remove the project’s shortcut from the Launcher." = "この操作ではランチャからプロジェクトのショートカットのみが取り除かれます。";
"This action will only remove the projects’ shortcuts from the Launcher." = "この操作ではランチャからプロジェクトのショートカットのみが取り除かれます。";


// First Launch

"Skip" = "スキップ";
"Are you sure you want to skip setup?" = "本当にセットアップをスキップしますか？";
"You can configure all of the settings covered here later in Preferences." = "ここで設定内容は後から、環境設定で個別に設定が可能です。";

"No sites found." = "サイト設定が見つかりませんでした。";
"1 site found." = "1 サイト設定が見つかりました。";
"%@ sites found." = "%@ サイト設定が見つかりました。";

"No clips found." = "クリップが見つかりませんでした。";
"1 clip found." = "1 クリップが見つかりました。";
"%@ clips found." = "%@ クリップが見つかりました。";

"Coda 2" = "Coda 2";


// Progress

"%@ remaining" = "残り %@";
